-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Nov 17, 2023 at 10:15 AM
-- Server version: 10.4.28-MariaDB
-- PHP Version: 8.0.28

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `pao_car`
--

-- --------------------------------------------------------

--
-- Table structure for table `failed_jobs`
--

CREATE TABLE `failed_jobs` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `uuid` varchar(255) NOT NULL,
  `connection` text NOT NULL,
  `queue` text NOT NULL,
  `payload` longtext NOT NULL,
  `exception` longtext NOT NULL,
  `failed_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `general_work`
--

CREATE TABLE `general_work` (
  `id` int(11) NOT NULL,
  `user_id` tinyint(4) NOT NULL,
  `group_code` tinyint(4) DEFAULT NULL,
  `brand` varchar(255) DEFAULT NULL,
  `model` varchar(255) DEFAULT NULL,
  `hp_kw` varchar(255) DEFAULT NULL,
  `type` varchar(255) DEFAULT NULL,
  `license` varchar(255) DEFAULT NULL,
  `code_machine` varchar(255) DEFAULT NULL,
  `year` int(11) DEFAULT NULL,
  `budget` float DEFAULT NULL,
  `old_use` int(11) DEFAULT NULL,
  `owner` varchar(255) DEFAULT NULL,
  `responsible_person` varchar(255) DEFAULT NULL,
  `phone` varchar(255) DEFAULT NULL,
  `path_img` text NOT NULL,
  `note` varchar(255) DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `is_status` tinyint(4) DEFAULT NULL,
  `deleted` tinyint(4) DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `general_work`
--

INSERT INTO `general_work` (`id`, `user_id`, `group_code`, `brand`, `model`, `hp_kw`, `type`, `license`, `code_machine`, `year`, `budget`, `old_use`, `owner`, `responsible_person`, `phone`, `path_img`, `note`, `created_at`, `is_status`, `deleted`, `updated_at`) VALUES
(1, 0, 15, 'HINO', 'VICTOR', '240 แรงม้า', 'รถบรรทุกขยะ  6  ล้อ', '84-2578', '011-62-0003', 2562, 0, 2, 'กองกิจการพาณิชย์', '', '', '', '', '2023-11-08 08:19:14', 0, 0, NULL),
(2, 0, 2, 'ARD', 'ไม่ได้ระบุรุ่น', '10  แรงม้า  ', 'รถบรรทุกน้ำเล็ก  4  ล้อ', 'ทช.นว.05-08', '006-47-0015', 2547, 132000, 17, 'กองกิจการพาณิชย์', '', '', '', 'รับโอนจากทางหลวงชนบท  เครื่องยนต์KUBOTA 1 สูบ', '2023-11-08 08:19:14', 0, 0, NULL),
(3, 0, 3, 'เตาต้มสี\r\n(น้ำมันโซล่า)', 'ไม่ได้ระบุรุ่น', '11  แรงม้า  ', 'เครื่องตีเส้นจราจร ', '', '073-60-0001', 2559, 502800, 5, 'กองช่าง', '', '', '', 'ดีเซล', '2023-11-08 08:19:14', 0, 0, NULL),
(4, 0, 3, 'รถตีเส้น\r\n(น้ำมันเบนซิน)', 'ไม่ได้ระบุรุ่น', '5  แรงม้า  ', 'เครื่องตีเส้นจราจร ', '', '073-60-0001', 2559, 502800, 5, 'กองช่าง', '', '', '', 'เบนซิน', '2023-11-08 08:19:14', 0, 0, NULL),
(5, 0, 4, 'ARD', 'ไม่ได้ระบุรุ่น', '', 'เตาต้มยางแบบล้อลากจูง', '', '109-47-0001', 2547, 0, 17, 'กองช่าง', '', '', '', 'รับโอนจากทางหลวงชนบท', '2023-11-08 08:19:14', 0, 0, NULL),
(6, 0, 4, 'SINGTHAI', 'ไม่ได้ระบุรุ่น', '', 'เตาต้มยางแบบล้อลากจูง', '', '109-51-0002', 2551, 750000, 13, 'กองช่าง', '', '', '', '', '2023-11-08 08:19:14', 0, 0, NULL),
(7, 0, 5, 'ไม่ได้ระบุยี่ห้อ', 'ไม่ได้ระบุรุ่น', '', 'ตัวโรยหินแบบกลไก', '', '043-54-0001', 2554, 479000, 10, 'กองช่าง', '', '', '', '', '2023-11-08 08:19:14', 0, 0, NULL),
(8, 0, 5, 'ไม่ได้ระบุยี่ห้อ', 'ไม่ได้ระบุรุ่น', '', 'ตัวโรยหินแบบกลไก', '', '043-54-0002', 2554, 479000, 10, 'กองช่าง', '', '', '', '', '2023-11-08 08:19:14', 0, 0, NULL),
(9, 0, 5, 'ไม่ได้ระบุยี่ห้อ', 'ไม่ได้ระบุรุ่น', '', 'ตัวกวาดถนน', '', '010-54-0001', 2554, 548000, 10, 'กองช่าง', '', '', '', '', '2023-11-08 08:19:14', 0, 0, NULL),
(10, 0, 6, 'CUMMINS', 'C550D5', '884.4  แรงม้า  ', 'เครื่องกำเนิดไฟฟ้า', '', '312-55-0002', 2555, 10000000, 10, 'กองกิจการพาณิชย์', '', '', '', 'เครื่องยนต์ดีเซล 6สูบ', '2023-11-08 08:19:14', 0, 0, NULL),
(11, 0, 6, 'CUMMINS', 'ไม่ได้ระบุรุ่น', '', 'เครื่องกำเนิดไฟฟ้า', '', '465-57-0005', 2557, 2965370, 7, 'กองช่าง', '', '', '', 'เครื่องยนต์ดีเซล 6สูบ', '2023-11-08 08:19:14', 0, 0, NULL),
(12, 0, 6, 'UROGEN', 'LS2-15 KW', '20.1 แรงม้า', 'เครื่องกำเนิดไฟฟ้า', '', '465-60-0006', 2560, 260000, 4, 'กองส่งเสริมคุณภาพชีวิต', '', '', '', '', '2023-11-08 08:19:14', 0, 0, NULL),
(13, 0, 6, 'UNITTO SILENT GENERTOR', 'UNT 60SB', '67 แรงม้า', 'เครื่องกำเนิดไฟฟ้า', '', '465-62-0007', 2562, 500000, 2, 'กองกิจการพาณิชย์', '', '', '', 'ดีเซล 50 KW', '2023-11-08 08:19:14', 0, 0, NULL),
(14, 0, 7, 'CUMMINS', '4B3.9', '76 แรงม้า', 'เครื่องสูบน้ำ', '', '055-37-0039', 2537, 363334, 27, 'สำนักปลัดฯ', '', '', '', 'เครื่องสูบน้ำแบบเครื่องยนต์ 4 สูบ หน้าปั้มดูดขนาด 8 นิ้ว', '2023-11-08 08:19:14', 0, 0, NULL),
(15, 0, 7, 'CUMMINS', '4B3.9', '76 แรงม้า', 'เครื่องสูบน้ำ', '', '055-37-0043', 2537, 363334, 27, 'สำนักปลัดฯ', '', '', '', 'เครื่องสูบน้ำแบบเครื่องยนต์ 4 สูบ หน้าปั้มดูดขนาด 8 นิ้ว', '2023-11-08 08:19:14', 0, 0, NULL),
(16, 0, 7, 'CUMMINS', '4B3.9', '76 แรงม้า', 'เครื่องสูบน้ำ', '', '055-37-0045', 2537, 363334, 27, 'สำนักปลัดฯ', '', '', '', 'เครื่องสูบน้ำแบบเครื่องยนต์ 4 สูบ หน้าปั้มดูดขนาด 8 นิ้ว', '2023-11-08 08:19:14', 0, 0, NULL),
(17, 0, 7, 'CUMMINS', '4B3.9', '76 แรงม้า', 'เครื่องสูบน้ำ', '', '055-37-0051', 2537, 363334, 27, 'สำนักปลัดฯ', '', '', '', 'เครื่องสูบน้ำแบบเครื่องยนต์ 4 สูบ หน้าปั้มดูดขนาด 8 นิ้ว', '2023-11-08 08:19:14', 0, 0, NULL),
(18, 0, 7, 'CUMMINS', '4B3.9', '76 แรงม้า', 'เครื่องสูบน้ำ', '', '055-37-0055', 2537, 363334, 27, 'สำนักปลัดฯ', '', '', '', 'เครื่องสูบน้ำแบบเครื่องยนต์ 4 สูบ หน้าปั้มดูดขนาด 8 นิ้ว', '2023-11-08 08:19:14', 0, 0, NULL),
(19, 0, 7, 'CUMMINS', '4B3.9', '76 แรงม้า', 'เครื่องสูบน้ำ', '', '055-37-0059', 2537, 363334, 27, 'สำนักปลัดฯ', '', '', '', 'เครื่องสูบน้ำแบบเครื่องยนต์ 4 สูบ หน้าปั้มดูดขนาด 8 นิ้ว', '2023-11-08 08:19:14', 0, 0, NULL),
(20, 0, 7, 'CUMMINS', '4B3.9', '76 แรงม้า', 'เครื่องสูบน้ำ', '', '055-37-0063', 2537, 363334, 27, 'สำนักปลัดฯ', '', '', '', 'เครื่องสูบน้ำแบบเครื่องยนต์ 4 สูบ หน้าปั้มดูดขนาด 8 นิ้ว', '2023-11-08 08:19:14', 0, 0, NULL),
(21, 0, 8, 'Honda', 'UMX 435', '', 'เครื่องตัดหญ้าแบบสะพาย', '', '442-54-0098', 2554, 0, 10, 'กองกิจการพาณิชย์', '', '', '', '', '2023-11-08 08:19:14', 0, 0, NULL),
(22, 0, 8, 'Honda', 'UMX 435', '', 'เครื่องตัดหญ้าแบบสะพาย', '', '442-54-0109', 2554, 0, 10, 'กองกิจการพาณิชย์', '', '', '', '', '2023-11-08 08:19:14', 0, 0, NULL),
(23, 0, 8, 'Honda', 'UMX 435', '', 'เครื่องตัดหญ้าแบบสะพาย', '', '442-54-0112', 2554, 0, 10, 'กองกิจการพาณิชย์', '', '', '', '', '2023-11-08 08:19:14', 0, 0, NULL),
(24, 0, 8, 'Makita', 'ไม่ได้ระบุรุ่น', '', 'เครื่องตัดหญ้าแบบสะพาย', '', '442-57-0120', 2557, 0, 7, 'กองกิจการพาณิชย์', '', '', '', '', '2023-11-08 08:19:14', 0, 0, NULL),
(25, 0, 8, 'Makita', 'ไม่ได้ระบุรุ่น', '', 'เครื่องตัดหญ้าแบบสะพาย', '', '442-57-0121', 2557, 0, 7, 'กองกิจการพาณิชย์', '', '', '', '', '2023-11-08 08:19:14', 0, 0, NULL),
(26, 0, 8, 'Makita', 'ไม่ได้ระบุรุ่น', '', 'เครื่องตัดหญ้าแบบสะพาย', '', '442-57-0122', 2557, 0, 7, 'กองกิจการพาณิชย์', '', '', '', '', '2023-11-08 08:19:14', 0, 0, NULL),
(27, 0, 8, 'Makita', 'ไม่ได้ระบุรุ่น', '', 'เครื่องตัดหญ้าแบบสะพาย', '', '442-57-0123', 2557, 0, 7, 'กองกิจการพาณิชย์', '', '', '', '', '2023-11-08 08:19:14', 0, 0, NULL),
(28, 0, 8, 'Makita', 'ไม่ได้ระบุรุ่น', '', 'เครื่องตัดหญ้าแบบสะพาย', '', '442-57-0124', 2557, 0, 7, 'กองกิจการพาณิชย์', '', '', '', '', '2023-11-08 08:19:14', 0, 0, NULL),
(29, 0, 8, 'Makita', 'ไม่ได้ระบุรุ่น', '', 'เครื่องตัดหญ้าแบบสะพาย', '', '442-57-0125', 2557, 0, 7, 'กองกิจการพาณิชย์', '', '', '', '', '2023-11-08 08:19:14', 0, 0, NULL),
(30, 0, 8, 'Honda', 'GX-35 UMK 435T', '', 'เครื่องตัดหญ้าแบบสะพาย', '', '442-60-0131', 2560, 0, 4, 'กองกิจการพาณิชย์', '', '', '', '', '2023-11-08 08:19:14', 0, 0, NULL),
(31, 0, 8, 'Honda', 'GX-35 UMK 435T', '', 'เครื่องตัดหญ้าแบบสะพาย', '', '442-60-0132', 2560, 0, 4, 'กองกิจการพาณิชย์', '', '', '', '', '2023-11-08 08:19:14', 0, 0, NULL),
(32, 0, 8, 'Honda', 'GX-35 UMK 435T', '', 'เครื่องตัดหญ้าแบบสะพาย', '', '442-60-0133', 2560, 0, 4, 'กองกิจการพาณิชย์', '', '', '', '', '2023-11-08 08:19:14', 0, 0, NULL),
(33, 0, 8, 'Honda', 'GX-35 UMK 435T', '', 'เครื่องตัดหญ้าแบบสะพาย', '', '442-60-0134', 2560, 0, 4, 'กองกิจการพาณิชย์', '', '', '', '', '2023-11-08 08:19:14', 0, 0, NULL),
(34, 0, 8, 'Honda', 'GX-35 UMK 435T', '', 'เครื่องตัดหญ้าแบบสะพาย', '', '442-60-0135', 2560, 0, 4, 'กองกิจการพาณิชย์', '', '', '', '', '2023-11-08 08:19:14', 0, 0, NULL),
(35, 0, 8, 'Husqvarna', '143R-11', '', 'เครื่องตัดหญ้าแบบสะพาย', '', '442-60-0136', 2560, 0, 4, 'กองช่าง', '', '', '', '', '2023-11-08 08:19:14', 0, 0, NULL),
(36, 0, 8, 'Husqvarna', '143R-11', '', 'เครื่องตัดหญ้าแบบสะพาย', '', '442-60-0137', 2560, 0, 4, 'กองช่าง', '', '', '', '', '2023-11-08 08:19:14', 0, 0, NULL),
(37, 0, 8, 'Husqvarna', '143R-11', '', 'เครื่องตัดหญ้าแบบสะพาย', '', '442-60-0138', 2560, 0, 4, 'กองช่าง', '', '', '', '', '2023-11-08 08:19:14', 0, 0, NULL),
(38, 0, 8, 'Husqvarna', '143R-11', '', 'เครื่องตัดหญ้าแบบสะพาย', '', '442-60-0139', 2560, 0, 4, 'กองช่าง', '', '', '', '', '2023-11-08 08:19:14', 0, 0, NULL),
(39, 0, 8, 'Husqvarna', '143R-11', '', 'เครื่องตัดหญ้าแบบสะพาย', '', '442-60-0140', 2560, 0, 4, 'กองช่าง', '', '', '', '', '2023-11-08 08:19:14', 0, 0, NULL),
(40, 0, 8, 'Husqvarna', '143R-11', '', 'เครื่องตัดหญ้าแบบสะพาย', '', '442-60-0141', 2560, 0, 4, 'กองช่าง', '', '', '', '', '2023-11-08 08:19:14', 0, 0, NULL),
(41, 0, 8, 'Husqvarna', '143R-11', '', 'เครื่องตัดหญ้าแบบสะพาย', '', '442-60-0142', 2560, 0, 4, 'กองช่าง', '', '', '', '', '2023-11-08 08:19:14', 0, 0, NULL),
(42, 0, 8, 'Husqvarna', '143R-11', '', 'เครื่องตัดหญ้าแบบสะพาย', '', '442-60-0143', 2560, 0, 4, 'กองช่าง', '', '', '', '', '2023-11-08 08:19:14', 0, 0, NULL),
(43, 0, 8, 'Husqvarna', '143R-11', '', 'เครื่องตัดหญ้าแบบสะพาย', '', '442-60-0144', 2560, 0, 4, 'กองช่าง', '', '', '', '', '2023-11-08 08:19:14', 0, 0, NULL),
(44, 0, 8, 'Husqvarna', '143R-11', '', 'เครื่องตัดหญ้าแบบสะพาย', '', '442-60-0145', 2560, 0, 4, 'กองช่าง', '', '', '', '', '2023-11-08 08:19:14', 0, 0, NULL),
(45, 0, 8, 'Husqvarna', '143R-11', '', 'เครื่องตัดหญ้าแบบสะพาย', '', '442-60-0146', 2560, 0, 4, 'กองช่าง', '', '', '', '', '2023-11-08 08:19:14', 0, 0, NULL),
(46, 0, 8, 'Husqvarna', '143R-11', '', 'เครื่องตัดหญ้าแบบสะพาย', '', '442-60-0147', 2560, 0, 4, 'กองช่าง', '', '', '', '', '2023-11-08 08:19:14', 0, 0, NULL),
(47, 0, 9, 'TORO', 'ไม่ได้ระบุรุ่น', '', 'รถตัดหญ้าแบบนั่งขับ', '', '441-52-0021', 2552, 0, 12, 'กองกิจการพาณิชย์', '', '', '', '', '2023-11-08 08:19:14', 0, 0, NULL),
(48, 0, 9, 'JOHN DEERE', 'D105 ', '17.5 แรงม้า', 'รถตัดหญ้าแบบนั่งขับ', '', '441-62-0023', 2562, 0, 2, 'กองกิจการพาณิชย์', '', '', '', '', '2023-11-08 08:19:14', 0, 0, NULL),
(49, 0, 9, 'JOHN DEERE', 'D105 ', '17.5 แรงม้า', 'รถตัดหญ้าแบบนั่งขับ', '', '441-62-0023', 2562, 0, 2, 'กองกิจการพาณิชย์', '', '', '', '', '2023-11-08 08:19:14', 0, 0, NULL),
(50, 0, 10, 'Best  Fogger', 'BF-150', '', 'เครื่องพ่นหมอกควัน', '', '054-58-0077', 2558, 0, 6, 'สำนักปลัดฯ', '', '', '', '', '2023-11-08 08:19:14', 0, 0, NULL),
(51, 0, 10, 'Best  Fogger', 'BF-150', '', 'เครื่องพ่นหมอกควัน', '', '054-58-0078', 2558, 0, 6, 'สำนักปลัดฯ', '', '', '', '', '2023-11-08 08:19:14', 0, 0, NULL),
(52, 0, 10, 'Best  Fogger', 'BF-150', '', 'เครื่องพ่นหมอกควัน', '', '054-58-0079', 2558, 0, 6, 'สำนักปลัดฯ', '', '', '', '', '2023-11-08 08:19:14', 0, 0, NULL),
(53, 0, 10, 'Best  Fogger', 'BF-150', '', 'เครื่องพ่นหมอกควัน', '', '054-58-0080', 2558, 0, 6, 'สำนักปลัดฯ', '', '', '', '', '2023-11-08 08:19:14', 0, 0, NULL),
(54, 0, 10, 'Best  Fogger', 'BF-150', '', 'เครื่องพ่นหมอกควัน', '', '054-58-0081', 2558, 0, 6, 'สำนักปลัดฯ', '', '', '', '', '2023-11-08 08:19:14', 0, 0, NULL),
(55, 0, 10, 'Best  Fogger', 'BF-150', '', 'เครื่องพ่นหมอกควัน', '', '054-58-0082', 2558, 0, 6, 'สำนักปลัดฯ', '', '', '', '', '2023-11-08 08:19:14', 0, 0, NULL),
(56, 0, 10, 'Best  Fogger', 'BF-150', '', 'เครื่องพ่นหมอกควัน', '', '054-58-0083', 2558, 0, 6, 'สำนักปลัดฯ', '', '', '', '', '2023-11-08 08:19:14', 0, 0, NULL),
(57, 0, 10, 'Best  Fogger', 'BF-150', '', 'เครื่องพ่นหมอกควัน', '', '054-58-0084', 2558, 0, 6, 'สำนักปลัดฯ', '', '', '', '', '2023-11-08 08:19:14', 0, 0, NULL),
(58, 0, 10, 'Best  Fogger', 'BF-150', '', 'เครื่องพ่นหมอกควัน', '', '054-58-0085', 2558, 0, 6, 'สำนักปลัดฯ', '', '', '', '', '2023-11-08 08:19:14', 0, 0, NULL),
(59, 0, 10, 'Best  Fogger', 'BF-150', '', 'เครื่องพ่นหมอกควัน', '', '054-58-0086', 2558, 0, 6, 'สำนักปลัดฯ', '', '', '', '', '2023-11-08 08:19:14', 0, 0, NULL),
(60, 0, 10, 'Best  Fogger', 'BF-150', '', 'เครื่องพ่นหมอกควัน', '', '054-58-0087', 2558, 0, 6, 'สำนักปลัดฯ', '', '', '', '', '2023-11-08 08:19:14', 0, 0, NULL),
(61, 0, 10, 'Best  Fogger', 'BF-150', '', 'เครื่องพ่นหมอกควัน', '', '054-58-0088', 2558, 0, 6, 'สำนักปลัดฯ', '', '', '', '', '2023-11-08 08:19:14', 0, 0, NULL),
(62, 0, 10, 'Best  Fogger', 'BF-150', '', 'เครื่องพ่นหมอกควัน', '', '054-58-0089', 2558, 0, 6, 'สำนักปลัดฯ', '', '', '', '', '2023-11-08 08:19:14', 0, 0, NULL),
(63, 0, 10, 'Best  Fogger', 'BF-150', '', 'เครื่องพ่นหมอกควัน', '', '054-58-0090', 2558, 0, 6, 'สำนักปลัดฯ', '', '', '', '', '2023-11-08 08:19:14', 0, 0, NULL),
(64, 0, 10, 'Best  Fogger', 'BF-150', '', 'เครื่องพ่นหมอกควัน', '', '054-58-0091', 2558, 0, 6, 'สำนักปลัดฯ', '', '', '', '', '2023-11-08 08:19:14', 0, 0, NULL),
(65, 0, 10, 'Best  Fogger', 'BF-150', '', 'เครื่องพ่นหมอกควัน', '', '054-58-0092', 2558, 0, 6, 'สำนักปลัดฯ', '', '', '', '', '2023-11-08 08:19:14', 0, 0, NULL),
(66, 0, 10, 'Best  Fogger', 'BF-150', '', 'เครื่องพ่นหมอกควัน', '', '054-58-0093', 2558, 0, 6, 'สำนักปลัดฯ', '', '', '', '', '2023-11-08 08:19:14', 0, 0, NULL),
(67, 0, 10, 'Best  Fogger', 'BF-150', '', 'เครื่องพ่นหมอกควัน', '', '054-58-0094', 2558, 0, 6, 'สำนักปลัดฯ', '', '', '', '', '2023-11-08 08:19:14', 0, 0, NULL),
(68, 0, 11, 'Fyran Boats', '650 Horizon', '', 'เรือเร็ว', '', '029-50-0003', 2550, 0, 14, 'กองกิจการพาณิชย์', '', '', '', 'เรือเร็ว', '2023-11-08 08:19:14', 0, 0, NULL),
(69, 0, 11, 'Twineye', 'AL 400 FV', '', 'เรืออลูมิเนียม', '', '029-51-0004', 2551, 0, 13, 'สำนักปลัดฯ', '', '', '', 'เรืออลูมิเนียม', '2023-11-08 08:19:14', 0, 0, NULL),
(70, 0, 12, 'Honda', 'GX 390', '', 'เรือท้องแบน', '', '030-53-0103', 2553, 0, 11, 'สำนักปลัดฯ', '', '', '', 'แบบไฟเบอร์กลาสพร้อมเครื่องยนต์', '2023-11-08 08:19:14', 0, 0, NULL),
(71, 0, 12, 'Honda', 'GX 390', '', 'เรือท้องแบน', '', '030-53-0104', 2553, 0, 11, 'สำนักปลัดฯ', '', '', '', 'แบบไฟเบอร์กลาสพร้อมเครื่องยนต์', '2023-11-08 08:19:14', 0, 0, NULL),
(72, 0, 12, 'Honda', 'GX 390', '', 'เรือท้องแบน', '', '030-53-0105', 2553, 0, 11, 'สำนักปลัดฯ', '', '', '', 'แบบไฟเบอร์กลาสพร้อมเครื่องยนต์', '2023-11-08 08:19:14', 0, 0, NULL),
(73, 0, 12, 'Honda', 'GX 390', '', 'เรือท้องแบน', '', '030-54-0308', 2553, 0, 11, 'สำนักปลัดฯ', '', '', '', 'แบบไฟเบอร์กลาสพร้อมเครื่องยนต์', '2023-11-08 08:19:14', 0, 0, NULL),
(74, 0, 12, 'Honda', 'GX 390', '', 'เรือท้องแบน', '', '030-54-0309', 2553, 0, 11, 'สำนักปลัดฯ', '', '', '', 'แบบไฟเบอร์กลาสพร้อมเครื่องยนต์', '2023-11-08 08:19:14', 0, 0, NULL),
(75, 0, 12, 'Honda', 'GX 390', '', 'เรือท้องแบน', '', '030-54-0310', 2553, 0, 11, 'สำนักปลัดฯ', '', '', '', 'แบบไฟเบอร์กลาสพร้อมเครื่องยนต์', '2023-11-08 08:19:14', 0, 0, NULL),
(76, 0, 12, 'Honda', 'GX 390', '', 'เรือท้องแบน', '', '030-54-0311', 2553, 0, 11, 'สำนักปลัดฯ', '', '', '', 'แบบไฟเบอร์กลาสพร้อมเครื่องยนต์', '2023-11-08 08:19:14', 0, 0, NULL),
(83, 1, NULL, 'CASIO', 'PC800-99', '93 แรงม้า แรงม้า', 'เรือท้องแบน', 'p-12235', '444-99-8888', 2566, 6000, NULL, 'สำนักงานเลขานุการฯ', 'Scream  Aline2', '6666666667', 'image/generals/1782077234599015.jpg|image/generals/1782077234599573.jpg|image/generals/1782077234599886.jpg', 'test234', '2023-11-16 04:19:03', 0, 1, '2023-11-15 21:19:03');

-- --------------------------------------------------------

--
-- Table structure for table `logdata`
--

CREATE TABLE `logdata` (
  `id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `action` text NOT NULL,
  `rank_user` text NOT NULL,
  `name_user` text NOT NULL,
  `license` text NOT NULL,
  `code_machine` text NOT NULL,
  `old_data` text NOT NULL,
  `new_data` text NOT NULL,
  `time_add` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `logdata`
--

INSERT INTO `logdata` (`id`, `user_id`, `action`, `rank_user`, `name_user`, `license`, `code_machine`, `old_data`, `new_data`, `time_add`) VALUES
(1, 1, 'Add Car', '2', 'Admin', 'PC 1420', '000-000000', 'null', '1|BMW|TEST2|รถเก๋ง|PC 1420|000-000000|2567|999999|กองกิจการพาณิชย์|The Test|0698765432|image/cars/1781870078650473.jpg|image/cars/1781870078651364.jpg|image/cars/1781870078651908.jpg|image/cars/1781870078652436.jpg|image/cars/1781870078652973.jpg|image/cars/1781870078653493.jpg|image/cars/1781870078654322.jpg|Note Test Data|0|0|2023-11-07 02:22:09', '2023-11-06 19:22:09'),
(2, 1, 'Add Car', '2', 'Admin', 'PC 1420', '000-000000', 'null', '1|BMW|TEST2|รถเก๋ง|PC 1420|000-000000|2567|999999|กองกิจการพาณิชย์|The Test|0698765432||Note Test Data|0|0|2023-11-07 02:38:39', '2023-11-06 19:38:39'),
(3, 1, 'Add Car', '2', 'Admin', 'OP 5632', '111-96-8654', 'null', '1|CHEVROLET|TEST3|รถกระบะ แบบแค็บ|OP 5632|111-96-8654|2542|875521|กองกิจการพาณิชย์|Doramon|8888888888|image/cars/1781873253604989.jpg|image/cars/1781873253605856.jpg|image/cars/1781873253606451.jpg|image/cars/1781873253607000.jpg|image/cars/1781873253607525.jpg|image/cars/1781873253608047.jpg|image/cars/1781873253608575.jpg|test test test test test|0|0|2023-11-07 03:12:37', '2023-11-06 20:12:37'),
(4, 1, 'Edit Car', '2', 'Admin', 'OP 5633', '222-666-9999', '187|1||CHEVROLET|TEST3|รถกระบะ แบบแค็บ|OP 5632|111-96-8654|2542|875521||กองกิจการพาณิชย์|Doramon|8888888888|image/cars/1781873253604989.jpg|image/cars/1781873253605856.jpg|image/cars/1781873253606451.jpg|image/cars/1781873253607000.jpg|image/cars/1781873253607525.jpg|image/cars/1781873253608047.jpg|image/cars/1781873253608575.jpg|test test test test test|2023-11-07T03:12:37.000000Z|0|0', '1|CHEVROLET|CAMERO|รถเก๋ง|OP 5633|222-666-9999|2543|875521|กองคลัง|Shisua|9999999999||test2 test2 test2 test2 test2|0|0|2023-11-08 02:07:39', '2023-11-07 19:07:39'),
(5, 1, 'Edit Car', '2', 'Admin', 'OP 5633', '222-666-9999', '187|1||CHEVROLET|TEST3|รถกระบะ แบบแค็บ|OP 5632|111-96-8654|2542|875521||กองกิจการพาณิชย์|Doramon|8888888888|image/cars/1781873253604989.jpg|image/cars/1781873253605856.jpg|image/cars/1781873253606451.jpg|image/cars/1781873253607000.jpg|image/cars/1781873253607525.jpg|image/cars/1781873253608047.jpg|image/cars/1781873253608575.jpg|test test test test test|2023-11-07T03:12:37.000000Z|0|0', '1|CHEVROLET|CAMERO|รถเก๋ง|OP 5633|222-666-9999|2543|875521|กองคลัง|Shisua|9999999999||test2 test2 test2 test2 test2|0|0|2023-11-08 02:12:05', '2023-11-07 19:12:05'),
(6, 1, 'Edit Car', '2', 'Admin', 'OP 5633', '222-666-9999', '187|1||CHEVROLET|TEST3|รถกระบะ แบบแค็บ|OP 5632|111-96-8654|2542|875521||กองกิจการพาณิชย์|Doramon|8888888888|image/cars/1781873253604989.jpg|image/cars/1781873253605856.jpg|image/cars/1781873253606451.jpg|image/cars/1781873253607000.jpg|image/cars/1781873253607525.jpg|image/cars/1781873253608047.jpg|image/cars/1781873253608575.jpg|test test test test test|2023-11-07T03:12:37.000000Z|0|0|', '1|CHEVROLET|CAMERO|รถเก๋ง|OP 5633|222-666-9999|2543|875521|กองคลัง|Shisua|9999999999||test2 test2 test2 test2 test2|0|0|2023-11-08 02:12:52', '2023-11-07 19:12:52'),
(7, 1, 'Edit Car', '2', 'Admin', 'OP 5633', '222-666-9999', '187|1||CHEVROLET|CAMERO|รถเก๋ง|OP 5633|222-666-9999|2543|875521||กองคลัง|Shisua|9999999999||test2 test2 test2 test2 test2|2023-11-08T02:12:52.000000Z|0|0|2023-11-08T02:12:52.000000Z', '1|CHEVROLET|CAMERO|รถเก๋ง|OP 5633|222-666-9999|2543|875521|กองคลัง|Shisua|9999999999||test2 test2 test2 test2 test2|0|0|2023-11-08 02:21:40', '2023-11-07 19:21:40'),
(8, 1, 'Edit Car', '2', 'Admin', 'OP 5633', '222-666-9999', '187|1||CHEVROLET|CAMERO|รถเก๋ง|OP 5633|222-666-9999|2543|875521||กองคลัง|Shisua|9999999999||test2 test2 test2 test2 test2|2023-11-08T02:21:40.000000Z|0|0|2023-11-08T02:21:40.000000Z', '1|CHEVROLET|CAMERO|รถเก๋ง|OP 5633|222-666-9999|2543|875521|กองคลัง|Shisua|9999999999||test2 test2 test2 test2 test2|0|0|2023-11-08 02:23:23', '2023-11-07 19:23:23'),
(9, 1, 'Edit Car', '2', 'Admin', 'OP 5633', '222-666-9999', '187|1||CHEVROLET|CAMERO|รถเก๋ง|OP 5633|222-666-9999|2543|875521||กองคลัง|Shisua|9999999999||test2 test2 test2 test2 test2|2023-11-08T02:23:23.000000Z|0|0|2023-11-08T02:23:23.000000Z', '1|CHEVROLET|CAMERO|รถเก๋ง|OP 5633|222-666-9999|2543|875521|กองคลัง|Shisua|9999999999||test2 test2 test2 test2 test2|0|0|2023-11-08 02:30:27', '2023-11-07 19:30:27'),
(10, 1, 'Add Car', '2', 'Admin', 'ds6969', '23456-5465', 'null', '1|HYUNDAI|H1|รถตู้|ds6969|23456-5465|2566|8000000|รร.สวนกุหลาบฯ|Tsuneo|056279442|image/cars/1781964940419063.jpg|image/cars/1781964940420258.jpg|image/cars/1781964940421211.jpg|fd1245|0|0|2023-11-08 03:29:56', '2023-11-07 20:29:56'),
(11, 1, 'Add Car', '2', 'Admin', 'PC 1420', '01513215125', 'null', '1|FORD|SSSS|รถเก๋ง|PC 1420|01513215125|2567|1234567890|กองกิจการพาณิชย์|Doramon|056279442|image/cars/1781967144019337.jpg|image/cars/1781967144020190.jpg|image/cars/1781967144020782.jpg|image/cars/1781967144021335.jpg|image/cars/1781967144021867.jpg|image/cars/1781967144022402.jpg|image/cars/1781967144022925.jpg|image/cars/1781967144023441.jpg|image/cars/1781967144023943.jpg|image/cars/1781967144024470.jpg|Test|0|0|2023-11-08 04:04:57', '2023-11-07 21:04:57'),
(12, 1, 'Edit Car', '2', 'Admin', 'kid 1412', '000-123456789', '186|1||BMW|Z4|รถเก๋ง|kid 1412|000-123456789|2568|1234570000||กองช่าง|The Test3|0123456789||Hello World|2023-11-08T03:27:51.000000Z|0|0|2023-11-08T03:27:51.000000Z', '1|BMW|Z4|รถเก๋ง|kid 1412|000-123456789|2568|1234570000|กองช่าง|The Test3|0123456789|image/cars/1781967387517127.jpg|image/cars/1781967387518016.jpg|Hello World|0|0|2023-11-08 04:08:50', '2023-11-07 21:08:50'),
(13, 1, 'Edit Car', '2', 'Admin', 'kid 1412', '000-123456789', '186|1||BMW|Z4|รถเก๋ง|kid 1412|000-123456789|2568|1234570000||กองช่าง|The Test3|0123456789||Hello World|2023-11-08T03:27:51.000000Z|0|0|2023-11-08T03:27:51.000000Z', '1|BMW|Z4|รถเก๋ง|kid 1412|000-123456789|2568|1234570000|กองช่าง|The Test3|0123456789|image/cars/1781967445482210.jpg|image/cars/1781967445483092.jpg|Hello World|0|0|2023-11-08 04:09:45', '2023-11-07 21:09:45'),
(14, 1, 'Add Machine', '2', 'Admin', 'PC-1001', '333-22-4444', 'null', '1|MITSUBISHI|HAHAHAHA|สเปรย์ยาง 6 ล้อ|PC-1001|333-22-4444|2565|90000000|กองช่าง|Uchiwa Itachi|9999999999|image/machines/1781983635463345.jpg|image/machines/1781983635464169.jpg|image/machines/1781983635464752.jpg|image/machines/1781983635465545.jpg|image/machines/1781983635466105.jpg|test machine|0|0|2023-11-08 08:27:05', '2023-11-08 01:27:05'),
(15, 1, 'Add Machine', '2', 'Admin', 'PC-1001', '333-22-4444', 'null', '1|MITSUBISHI|HAHAHAHA|สเปรย์ยาง 6 ล้อ|PC-1001|333-22-4444|2565|90000000|กองช่าง|Uchiwa Itachi|9999999999|image/machines/1781983665959971.jpg|image/machines/1781983665960881.jpg|image/machines/1781983665961683.jpg|image/machines/1781983665962437.jpg|image/machines/1781983665962999.jpg|test machine|0|0|2023-11-08 08:27:34', '2023-11-08 01:27:34'),
(16, 1, 'Add Machine', '2', 'Admin', 'PC-1001', '333-22-4444', 'null', '1|MITSUBISHI|HAHAHAHA|สเปรย์ยาง 6 ล้อ|PC-1001|333-22-4444|2565|90000000|กองช่าง|Uchiwa Itachi|9999999999|image/machines/1781983677737474.jpg|image/machines/1781983677738292.jpg|image/machines/1781983677738867.jpg|image/machines/1781983677739424.jpg|image/machines/1781983677739967.jpg|test machine|0|0|2023-11-08 08:27:45', '2023-11-08 01:27:45'),
(17, 1, 'Add Machine', '2', 'Admin', 'PC-1001', '333-22-4444', 'null', '1|MITSUBISHI|HAHAHAHA|สเปรย์ยาง 6 ล้อ|PC-1001|333-22-4444|2565|90000000|กองช่าง|Uchiwa Itachi|9999999999|image/machines/1781983723647446.jpg|image/machines/1781983723648296.jpg|image/machines/1781983723649071.jpg|image/machines/1781983723649750.jpg|image/machines/1781983723650354.jpg|test machine|0|0|2023-11-08 08:28:29', '2023-11-08 01:28:29'),
(18, 1, 'Edit Machine', '2', 'Admin', 'CP-9999', '444-33-2222', '136|1||MITSUBISHI|HAHAHAHA|สเปรย์ยาง 6 ล้อ|PC-1001|333-22-4444|2565|90000000||กองช่าง|Uchiwa Itachi|9999999999|image/machines/1781983723647446.jpg|image/machines/1781983723648296.jpg|image/machines/1781983723649071.jpg|image/machines/1781983723649750.jpg|image/machines/1781983723650354.jpg|test machine|2023-11-08T08:28:29.000000Z|0|0|', '1|HINO|AHAHAHAHA|รถบรรทุกน้ำ 10 ล้อ|CP-9999|444-33-2222|2543|90000009|รร.สวนกุหลาบฯ|Uchiwa Itachi2|8888888889|image/machines/1781986373942757.jpg|image/machines/1781986373943611.jpg|test machine2|0|0|2023-11-08 09:10:37', '2023-11-08 02:10:37'),
(19, 1, 'Add Truck', '2', 'Admin', 'จ-7865', '111-22-4684', 'null', '1|หางพ่วง TBT|PC300-80|รถบรรทุกติดตั้งเครนสลิง|จ-7865|111-22-4684|8000 แรงม้า|2546|85000000|กองคลัง|Harry Potter|9999999999|image/trucks/1782067857381794.jpg|image/trucks/1782067857382564.jpg|image/trucks/1782067857382803.jpg|image/trucks/1782067857383429.jpg|test2|0|0|2023-11-09 06:45:45', '2023-11-08 23:45:45'),
(20, 1, 'Edit Truck', '2', 'Admin', 'จ-7865', '111-22-0000', '73|1||หางพ่วง TBT|PC300-80|8000 แรงม้า|รถบรรทุกติดตั้งเครนสลิง|จ-7865|111-22-4684|2546|85000000||กองคลัง|Harry Potter|9999999999|image/trucks/1782067857381794.jpg|image/trucks/1782067857382564.jpg|image/trucks/1782067857382803.jpg|image/trucks/1782067857383429.jpg|test2|2023-11-09T06:45:45.000000Z|0|0|', '1|HONDA|PC300-88|หางพ่วง|จ-7865|111-22-0000|900 แรงม้า |แรงม้า|2548|95000000|กองการเจ้าหน้าที่|Harry Potter2|0000000000|image/trucks/1782070123189955.jpg|image/trucks/1782070123190602.jpg|image/trucks/1782070123190976.jpg|image/trucks/1782070123191267.jpg|test222|0|0|2023-11-09 07:21:46', '2023-11-09 00:21:46'),
(21, 1, 'Edit Truck', '2', 'Admin', 'จ-7865', '111-22-0000', '73|1||หางพ่วง TBT|PC300-80|8000 แรงม้า|รถบรรทุกติดตั้งเครนสลิง|จ-7865|111-22-4684|2546|85000000||กองคลัง|Harry Potter|9999999999|image/trucks/1782067857381794.jpg|image/trucks/1782067857382564.jpg|image/trucks/1782067857382803.jpg|image/trucks/1782067857383429.jpg|test2|2023-11-09T06:45:45.000000Z|0|0|', '1|HONDA|PC300-88|หางพ่วง|จ-7865|111-22-0000|900 แรงม้า |แรงม้า|2548|95000000|กองการเจ้าหน้าที่|Harry Potter2|0000000000|image/trucks/1782070168541097.jpg|image/trucks/1782070168541506.jpg|image/trucks/1782070168541764.jpg|image/trucks/1782070168542017.jpg|test222|0|0|2023-11-09 07:22:29', '2023-11-09 00:22:29'),
(22, 1, 'Edit Truck', '2', 'Admin', 'จ-7865', '111-22-0000', '73|1||หางพ่วง TBT|PC300-80|8000 แรงม้า|รถบรรทุกติดตั้งเครนสลิง|จ-7865|111-22-4684|2546|85000000||กองคลัง|Harry Potter|9999999999|image/trucks/1782067857381794.jpg|image/trucks/1782067857382564.jpg|image/trucks/1782067857382803.jpg|image/trucks/1782067857383429.jpg|test2|2023-11-09T06:45:45.000000Z|0|0|', '1|HONDA|PC300-88|หางพ่วง|จ-7865|111-22-0000|900 แรงม้า |แรงม้า|2548|95000000|กองการเจ้าหน้าที่|Harry Potter2|0000000000|image/trucks/1782070180993190.jpg|image/trucks/1782070180993562.jpg|image/trucks/1782070180993821.jpg|image/trucks/1782070180994054.jpg|test222|0|0|2023-11-09 07:22:41', '2023-11-09 00:22:41'),
(23, 1, 'Edit Truck', '2', 'Admin', 'จ-7868', '111-22-0000', '73|1||หางพ่วง TBT|PC300-80|8000 แรงม้า|รถบรรทุกติดตั้งเครนสลิง|จ-7865|111-22-4684|2546|85000000||กองคลัง|Harry Potter|9999999999|image/trucks/1782067857381794.jpg|image/trucks/1782067857382564.jpg|image/trucks/1782067857382803.jpg|image/trucks/1782067857383429.jpg|test2|2023-11-09T06:45:45.000000Z|0|0|', '1|HONDA|PC300-88|รถบรรทุกขยะ|จ-7868|111-22-0000|9000 แรงม้า |แรงม้า|2546|85000000|กองกิจการพาณิชย์|Harry Potter2|0000000000|image/trucks/1782070489743082.jpg|image/trucks/1782070489743716.jpg|image/trucks/1782070489744072.jpg|image/trucks/1782070489744328.jpg|test22|0|0|2023-11-09 07:27:36', '2023-11-09 00:27:36'),
(24, 1, 'Add General', '2', 'Admin', 'p-12234', '444-99-7777', 'null', '1|TQUAR|PC800-78|เครื่องสูบน้ำ|p-12234|444-99-7777|63 แรงม้า|2560|600|สำนักงานเลขานุการฯ|Scream  Aline|6666666666|image/generals/1782075974851387.jpg|image/generals/1782075974851828.jpg|image/generals/1782075974852077.jpg|test233|0|0|2023-11-09 08:54:47', '2023-11-09 01:54:47'),
(25, 1, 'Edit General', '2', 'Admin', 'p-12235', '444-99-8888', '83|1||TQUAR|PC800-78|63 แรงม้า|เครื่องสูบน้ำ|p-12234|444-99-7777|2560|600||สำนักงานเลขานุการฯ|Scream  Aline|6666666666|image/generals/1782075974851387.jpg|image/generals/1782075974851828.jpg|image/generals/1782075974852077.jpg|test233|2023-11-09T08:54:47.000000Z|0|0|', '1|CASIO|PC800-99|เรือท้องแบน|p-12235|444-99-8888|93 แรงม้า |แรงม้า|2566|6000|สำนักงานเลขานุการฯ|Scream  Aline2|6666666667|image/generals/1782077234599015.jpg|image/generals/1782077234599573.jpg|image/generals/1782077234599886.jpg|test234|0|0|2023-11-09 09:14:48', '2023-11-09 02:14:48'),
(26, 2, 'Edit Machine', '1', 'User', 'olo1595', '789/456/132', '135|0||DYNAPAC|CHALLENGER|รถบดล้อยาง|olo1595|789/456/132|2561|900||กองช่าง|dominic conecto|9876543210||tranfromer|2023-11-08T15:14:12.000000Z|0|0|', '2|DYNAPAC|CHALLENGER|รถบดล้อยาง|olo1595|789/456/132|2561|900|กองช่าง|dominic conecto|9876543210|image/machines/1782793969646202.jpg|image/machines/1782793969647040.jpg|image/machines/1782793969647794.jpg|tranfromer|0|0|2023-11-17 07:07:00', '2023-11-17 00:07:00');

-- --------------------------------------------------------

--
-- Table structure for table `machine2`
--

CREATE TABLE `machine2` (
  `id` int(11) NOT NULL,
  `user_id` tinyint(4) NOT NULL,
  `group_code` int(11) DEFAULT NULL,
  `brand` varchar(255) DEFAULT NULL,
  `model` varchar(255) DEFAULT NULL,
  `type` varchar(255) DEFAULT NULL,
  `license` varchar(255) DEFAULT NULL,
  `code_machine` varchar(255) DEFAULT NULL,
  `year` int(11) DEFAULT NULL,
  `budget` float DEFAULT NULL,
  `old_use` int(11) DEFAULT NULL,
  `owner` varchar(255) DEFAULT NULL,
  `responsible_person` varchar(255) DEFAULT NULL,
  `phone` varchar(255) DEFAULT NULL,
  `path_img` text NOT NULL,
  `note` varchar(255) DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `is_status` tinyint(4) DEFAULT NULL,
  `deleted` tinyint(4) DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `machine2`
--

INSERT INTO `machine2` (`id`, `user_id`, `group_code`, `brand`, `model`, `type`, `license`, `code_machine`, `year`, `budget`, `old_use`, `owner`, `responsible_person`, `phone`, `path_img`, `note`, `created_at`, `is_status`, `deleted`, `updated_at`) VALUES
(1, 0, 1, 'KOMATSU', 'PC200-5A', 'ขุดไฮโดรลิค', 'ต-6411', '018-36-0008', 2536, 0, 28, 'กองช่าง', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(2, 0, 2, 'KOMATSU', 'PC200-7A', 'ขุดไฮโดรลิค', 'ตค-3401', '018-49-0014', 2549, 0, 15, 'กองช่าง', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(3, 0, 3, 'HITACHI', 'ZA 200-5G', 'ขุดไฮโดรลิค', 'ตฆ-6682', '018-56-0026', 2556, 0, 8, 'กองช่าง', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(4, 0, 4, 'HITACHI', 'ZA 200-5G', 'ขุดไฮโดรลิค', 'ตฆ-6681', '018-56-0027', 2556, 0, 8, 'กองช่าง', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(5, 0, 1, 'HITACHI', 'ZX 210 - LC', 'ขุดไฮโดรลิค บูมยาว', 'ตฆ-2727', '019-55-0006', 2556, 0, 8, 'กองช่าง', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(6, 0, 2, 'HITACHI', 'ZX 210 - LC', 'ขุดไฮโดรลิค บูมยาว', 'ตฆ-2728', '019-55-0007', 2556, 0, 8, 'กองช่าง', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(7, 0, 5, 'KOMATSU', 'PC200-7A', 'ขุดไฮโดรลิค', 'ตค-3400', '018-49-0011', 2549, 0, 15, 'กองช่าง', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(8, 0, 6, 'KOMATSU', 'PC200-7A', 'ขุดไฮโดรลิค', 'ตค-3402', '018-49-0012', 2549, 0, 15, 'กองช่าง', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(9, 0, 7, 'KOMATSU', 'PC200-7A', 'ขุดไฮโดรลิค', 'ตค-3404', '018-49-0013', 2549, 0, 15, 'กองช่าง', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(10, 0, 8, 'KOMATSU', 'PC200-7A', 'ขุดไฮโดรลิค', 'ตค-3403', '018-49-0015', 2549, 0, 15, 'กองช่าง', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(11, 0, 9, 'KOMATSU', 'PC200-7A', 'ขุดไฮโดรลิค', 'ตค-3432', '018-49-0016', 2549, 0, 15, 'กองช่าง', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(12, 0, 10, 'KOMATSU', 'PC200-7A', 'ขุดไฮโดรลิค', 'ตค-3433', '018-49-0017', 2549, 0, 15, 'กองช่าง', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(13, 0, 11, 'KOMATSU', 'PC200-7A', 'ขุดไฮโดรลิค', 'ตค-3434', '018-49-0018', 2549, 0, 15, 'กองช่าง', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(14, 0, 12, 'KOMATSU', 'PC200-7A', 'ขุดไฮโดรลิค', 'ตค-3435', '018-49-0019', 2549, 0, 15, 'กองช่าง', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(15, 0, 13, 'KOMATSU', 'PC200-7A', 'ขุดไฮโดรลิค', 'ตค-3436', '018-49-0020', 2549, 0, 15, 'กองช่าง', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(16, 0, 14, 'KOMATSU', 'PC200-7A', 'ขุดไฮโดรลิค', 'ตค-3437', '018-49-0021', 2549, 0, 15, 'กองช่าง', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(17, 0, 15, 'KOMATSU', 'PC200-7A', 'ขุดไฮโดรลิค', 'ตค-3438', '018-49-0022', 2549, 0, 15, 'กองช่าง', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(18, 0, 16, 'KOMATSU', 'PC200-7A', 'ขุดไฮโดรลิค', 'ตค-3440', '018-49-0023', 2549, 0, 15, 'กองช่าง', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(19, 0, 17, 'KOMATSU', 'PC200-7A', 'ขุดไฮโดรลิค', 'ตค-3441', '018-49-0024', 2549, 0, 15, 'กองช่าง', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(20, 0, 18, 'KOMATSU', 'PC200-7A', 'ขุดไฮโดรลิค', 'ตค-3442', '018-49-0025', 2549, 0, 15, 'กองช่าง', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(21, 0, 3, 'KOBELCO ', 'SK 210LC-10', 'ขุดไฮโดรลิค บูมยาว', 'ตจ 317', '018 63 0028', 2563, 0, 1, 'กองช่าง', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(22, 0, 4, 'KOBELCO ', 'SK 210LC-11', 'ขุดไฮโดรลิค บูมยาว', 'ตจ 318', '018 63 0029', 2563, 0, 1, 'กองช่าง', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(23, 0, 1, 'VOLVO', 'G720B', 'เกรดเดอร์ ', 'ตค-3454', '015-49-0005', 2549, 0, 15, 'กองช่าง', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(24, 0, 2, 'KOMATSU', 'GD611A-1', 'เกรดเดอร์ ', 'ต-6436', '015-37-0003', 2537, 0, 27, 'กองช่าง', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(25, 0, 3, 'MITSUBISHI', 'MG460', 'เกรดเดอร์ ', 'ตค-1590', '015-54-0006', 2554, 0, 10, 'กองช่าง', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(26, 0, 4, 'MITSUBISHI', 'MG460', 'เกรดเดอร์ ', 'ตค-1588', '015-54-0007', 2554, 0, 10, 'กองช่าง', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(27, 0, 5, 'MITSUBISHI', 'MG460', 'เกรดเดอร์ ', 'ตค-1589', '015-54-0008', 2554, 0, 10, 'กองช่าง', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(28, 0, 1, 'CATERPILLAR', 'D4HXL', 'แทร็คเตอร์', '-', '019-47-0005', 2547, 0, 17, 'กองช่าง', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(29, 0, 2, 'KOMATSU', 'D65E-12', 'แทร็คเตอร์', 'ตฆ-7775', '019-57-0009', 2557, 0, 7, 'กองช่าง', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(30, 0, 1, 'CUKUROVA', '833', 'รถตักหน้าขุดหลัง ', 'ตฆ-6406', '049-56-0001', 2556, 0, 8, 'กองช่าง', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(31, 0, 2, 'KAT', 'WZ 30-25', 'รถตักหน้าขุดหลัง ', 'ตง-2349', '049-59-0002', 2559, 0, 5, 'กองกิจการพาณิชย์', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(32, 0, 1, 'CATERPILLAR', 'CAT 930', 'รถตักล้อยาง ', 'อก-09', '018-20-0002', 2520, 0, 44, 'กองช่าง', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(33, 0, 1, 'SAKAI', 'TS-150', 'รถบดล้อยาง ', 'อก-017', '020-29-0001', 2529, 0, 35, 'กองช่าง', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(34, 0, 2, 'SINGTHAI', 'RT9-V10', 'รถบดล้อยาง ', 'ถข-78', '020-49-0002', 2549, 0, 15, 'กองช่าง', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(35, 0, 3, 'PUMAC', 'PUR-100', 'รถบดล้อยาง ', 'ถข-187', '020-59-0005', 2559, 0, 5, 'กองช่าง', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(36, 0, 1, 'SINGTHAI', 'DD4-V3', 'รถบดล้อเหล็กสั่นสะเทือน', 'ถข-107', '020-54-0004', 2554, 0, 10, 'กองช่าง', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(37, 0, 2, 'SINGTHAI', 'DV10-V4', 'รถบดล้อเหล็กสั่นสะเทือน', 'ถข-85', '020-54-0003', 2554, 0, 10, 'กองช่าง', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(38, 0, 3, 'DYNAPAC', 'CA 251 STD', 'รถบดล้อเหล็กสั่นสะเทือน', 'ถ-0040', '034-37-0001', 2537, 0, 27, 'กองช่าง', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(39, 0, 4, 'SINGTHAI', 'DV10-V4', 'รถบดล้อเหล็กสั่นสะเทือน', 'ถข-128', '034-54-0002', 2554, 0, 10, 'กองช่าง', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(40, 0, 5, 'SINGTHAI', 'DV10-V4', 'รถบดล้อเหล็กสั่นสะเทือน', 'ถข-129', '034-54-0003', 2554, 0, 10, 'กองช่าง', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(41, 0, 6, 'BOMAG', 'BW211D-40', 'รถบดล้อเหล็กสั่นสะเทือน', 'ถข-150', '034-56-0004', 2556, 0, 8, 'กองช่าง', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(42, 0, 1, 'NEWHOLLAND', 'L-220', 'ขุดเจาะอเนกประสงค์', 'ตฆ-4468', '044-56-0001', 2556, 0, 8, 'กองช่าง', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(43, 0, 1, 'KUBOTA', 'L2605', 'รถฟาร์มแทร็คเตอร์', 'ตค-2250', '036-46-0003', 2546, 0, 18, 'กองกิจการพาณิชย์', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(44, 0, 2, 'CHAMP', 'MX-4548', 'รถฟาร์มแทร็คเตอร์', 'ตค-6956', '036-52-0005', 2552, 0, 12, 'กองกิจการพาณิชย์', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(45, 0, 3, 'KUBOTA', 'RT110', 'รถฟาร์มแทร็คเตอร์', '-', '602-53-0002', 2553, 0, 11, 'กองกิจการพาณิชย์', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(46, 0, 4, 'YANMAR', 'TF 105 LM', 'รถฟาร์มแทร็คเตอร์', '-', '602-55-0003', 2555, 0, 9, 'กองกิจการพาณิชย์', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(47, 0, 1, 'EUROPEAN', 'FT 454', 'รถฟาร์มแทร็คเตอร์', 'ตค-7825', '036-52-0006', 2552, 0, 12, 'กองช่าง', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(48, 0, 2, 'EUROPEAN', 'FT 454', 'รถฟาร์มแทร็คเตอร์', 'ตค-9459', '036-52-0007', 2552, 0, 12, 'กองช่าง', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(49, 0, 1, 'DYNAPAC', 'F6-4W', 'รถปูยางแอสฟัลท์ติก', 'ตฆ-7258', '051-56-0001', 2556, 0, 8, 'กองช่าง', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(50, 0, 1, 'MITSUBISHI', '', 'รถบรรทุก ขนาด 4 ตัน', '81-7778', '002-37-0002', 2537, 0, 27, 'กองช่าง', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(51, 0, 2, 'MITSUBISHI', '', 'รถบรรทุก ขนาด 4 ตัน', '82-4485', '002-49-0003', 2549, 0, 15, 'กองช่าง', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(52, 0, 3, 'MITSUBISHI', '', 'รถบรรทุก ขนาด 6 ตัน', '82-5170', '002-50-0004', 2550, 0, 14, ' สำนักปลัดฯ', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(53, 0, 4, 'MITSUBISHI', '', 'รถบรรทุก ขนาด 4 ตัน', '82-5171', '002-50-0005', 2550, 0, 14, 'กองช่าง', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(54, 0, 5, 'MITSUBISHI', '', 'รถบรรทุก ขนาด 2 ตัน', '82-6258', '002-51-0007', 2551, 0, 13, 'กองช่าง', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(55, 0, 6, 'MITSUBISHI', '', 'รถบรรทุก ขนาด 2 ตัน', '82-6261', '002-51-0008', 2551, 0, 13, 'กองช่าง', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(56, 0, 7, 'ISUZU', '', 'รถบรรทุก ขนาด 4 ตัน', '83-1099', '002-54-0009', 2554, 0, 10, ' สำนักปลัดฯ', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(57, 0, 1, 'ISUZU', '', 'รถโดยสาร มินิบัส', '40-0321', '003-53-0001', 2553, 0, 11, 'กองการศึกษาและวัฒนธรรม', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(58, 0, 2, 'ISUZU', '', 'รถบรรทุกโดยสาร', '40-0365', '002-58-0010', 2558, 0, 6, 'รร.สวนกุหลาบฯ', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(59, 0, 1, 'ARD', 'รถบรรทุกน้ำ 4 ล้อ', 'บรรทุกน้ำ 1 คิว', 'ทช.นว.05-08', '006-47-0015', 2547, 0, 17, 'กองกิจการพาณิชย์', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(60, 0, 1, 'HINO', 'HINO KL-300', 'รถบรรทุกน้ำ 6 ล้อ', 'อก-11', '006-22-0004', 2522, 0, 42, 'กองช่าง', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(61, 0, 2, 'ISUZU', 'ISUZU SBR', 'รถบรรทุกน้ำ 6 ล้อ', 'ทถ-14', '006-25-0005', 2525, 0, 39, 'กองกิจการพาณิชย์', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(62, 0, 2, 'MITSUBISHI', 'MITSUBISHI', 'รถบรรทุกน้ำ 6 ล้อ', '82-2376', '006-47-0012', 2547, 0, 17, 'กองช่าง', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(63, 0, 3, 'MITSUBISHI', 'MITSUBISHI', 'รถบรรทุกน้ำ 6 ล้อ', '82-2378', '006-47-0013', 2547, 0, 17, 'กองช่าง', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(64, 0, 4, 'ISUZU', 'ISUZU', 'รถบรรทุกน้ำ 6 ล้อ', '81-9334', '006-47-0014', 2547, 0, 17, 'กองช่าง', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(65, 0, 1, 'MITSUBISHI', 'MITSUBISHI', 'รถบรรทุกน้ำ 10 ล้อ', '83-6578', '006-34-0006', 2534, 0, 30, 'กองช่าง', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(66, 0, 1, 'MITSUBISHI', 'MITSUBISHI', 'รถบรรทุกน้ำ 10 ล้อ', '83-6579', '006-34-0007', 2534, 0, 30, 'กองกิจการพาณิชย์', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(67, 0, 2, 'ISUZU', 'ISUZU FVZ', 'รถบรรทุกน้ำ 10 ล้อ', '81-7786', '006-35-0008', 2535, 0, 29, 'กองช่าง', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(68, 0, 3, 'ISUZU', 'ISUZU FVZ', 'รถบรรทุกน้ำ 10 ล้อ', '81-7787', '006-35-0009', 2535, 0, 29, 'กองช่าง', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(69, 0, 4, 'ISUZU', 'ISUZU FVZ', 'รถบรรทุกน้ำ 10 ล้อ', '81-7788', '006-35-0010', 2535, 0, 29, 'กองช่าง', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(70, 0, 5, 'ISUZU', 'ISUZU FVZ', 'รถบรรทุกน้ำ 10 ล้อ', '81-7789', '006-35-0011', 2535, 0, 29, 'กองช่าง', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(71, 0, 7, 'ISUZU', 'ISUZU FVZ 33', 'รถบรรทุกน้ำ 10 ล้อ', 'บม-3290', '006-49-0016', 2549, 0, 15, ' สำนักปลัดฯ', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(72, 0, 8, 'ISUZU', 'ISUZU FVZ 33', 'รถบรรทุกน้ำ 10 ล้อ', 'บม-3291', '006-49-0017', 2549, 0, 15, ' สำนักปลัดฯ', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(73, 0, 9, 'ISUZU', 'ISUZU FVZ 33', 'รถบรรทุกน้ำ 10 ล้อ', 'บย-280', '006-50-0018', 2550, 0, 14, ' สำนักปลัดฯ', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(74, 0, 10, 'ISUZU', 'ISUZU FVZ 34', 'รถบรรทุกน้ำ 10 ล้อ', 'บษ-4842', '006-55-0019', 2555, 0, 9, ' สำนักปลัดฯ', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(75, 0, 6, 'ISUZU', 'ISUZU FVZ 34', 'รถบรรทุกน้ำ 10 ล้อ', 'บห-5575', '006-56-0020', 2556, 0, 8, 'กองช่าง', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(76, 0, 12, 'ISUZU', 'ISUZU FVZ 34', 'รถบรรทุกน้ำ 10 ล้อ', 'ผฉ 385', '006-59-0021', 2559, 0, 5, ' สำนักปลัดฯ', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(77, 0, 1, 'YANMAR', 'รถบรรทุกขยะ 4 ล้อ', 'รถบรรทุกขยะ 4 ล้อ', '-', '011-35-0001', 2535, 0, 29, 'กองกิจการพาณิชย์', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(78, 0, 1, 'MITSUBISHI', 'MITSUBISHI FUSO ', 'รถเทรลเลอร์ 10 ล้อ', '82-5880', '002-50-0006', 2550, 0, 14, 'กองช่าง', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(79, 0, 2, 'HINO ', 'HINO KT-925', 'รถเทรลเลอร์ 10 ล้อ', '81-7783', '013-27-0001', 2527, 0, 37, 'กองช่าง', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(80, 0, 3, 'NISSAN', 'NISSAN CW 30', 'รถเทรลเลอร์ 10 ล้อ', '82-2511', '013-48-0002', 2548, 0, 16, 'กองช่าง', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(81, 0, 1, 'MITSUBISHI', 'MITSUBISHI FUSO ', 'รถเทรลเลอร์ 18 ล้อ', '82-4201', '013-49-0004', 2549, 0, 15, 'กองช่าง', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(82, 0, 2, 'HINO ', 'HINO', 'รถเทรลเลอร์ 18 ล้อ', '83-1510', '013-55-0005', 2555, 0, 9, 'กองช่าง', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(83, 0, 1, 'ISUZU', 'ISUZU JCR', 'รถบรรทุกเทท้าย ', '81-7780', '017-26-0006', 2526, 0, 38, 'กองช่าง', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(84, 0, 2, 'HINO', 'HINO', 'รถบรรทุกเทท้าย ', '82-2377', '017-47-0013', 2547, 0, 17, 'กองช่าง', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(85, 0, 3, 'ISUZU', 'ISUZU ', 'รถบรรทุก ', '81-7675', '017-47-0015', 2547, 0, 17, 'กองช่าง', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(86, 0, 4, 'ISUZU', 'ISUZU ', 'รถบรรทุก ', '82-8565', '017-52-0016', 2552, 0, 12, 'กองช่าง', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(87, 0, 5, 'ISUZU', 'ISUZU ', 'รถบรรทุกเทท้าย ', '82-8747', '017-52-0017', 2552, 0, 12, 'กองช่าง', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(88, 0, 1, 'MITSUBISHI', 'รถบรรทุกเทท้าย 10 ล้อ', 'รถบรรทุกเทท้าย 10 ล้อ ', '81-7802', '017-29-0007', 2529, 0, 35, 'กองช่าง', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(89, 0, 2, 'MITSUBISHI  ', 'รถบรรทุกเทท้าย 10 ล้อ', 'รถบรรทุกเทท้าย 10 ล้อ ', '81-7790', '017-29-0008', 2529, 0, 35, 'กองช่าง', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(90, 0, 3, 'NISSAN', 'NISSAN CW 30', 'รถบรรทุกเทท้าย 10 ล้อ ', '81-7785', '017-33-0009', 2533, 0, 31, 'กองช่าง', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(91, 0, 4, 'HINO ', 'HINO FM 227', 'รถบรรทุกเทท้าย 10 ล้อ ', '81-7784', '017-35-0010', 2535, 0, 29, 'กองช่าง', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(92, 0, 5, 'HINO', 'HINO FM 1M', 'รถบรรทุกเทท้าย 10 ล้อ ', '81-7782', '017-37-0011', 2537, 0, 27, 'กองช่าง', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(93, 0, 6, 'MITSUBISHI ', 'MITSUBISHI ', 'รถบรรทุกเทท้าย 10 ล้อ ', '81-7781', '017-37-0012', 2537, 0, 27, 'กองช่าง', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(94, 0, 7, 'HINO', 'HINO FM 8J', 'รถบรรทุกเทท้าย 10 ล้อ ', '83-1154', '017-54-0018', 2554, 0, 10, 'กองช่าง', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(95, 0, 8, 'HINO', 'HINO FM 8J', 'รถบรรทุกเทท้าย 10 ล้อ ', '83-1155', '017-54-0019', 2554, 0, 10, 'กองช่าง', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(96, 0, 9, 'ISUZU', 'ISUZU FVZ 34', 'รถบรรทุกเทท้าย 10 ล้อ ', '83-5317', '017-56-0022', 2556, 0, 8, 'กองช่าง', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(97, 0, 10, 'ISUZU', 'ISUZU FVZ 34', 'รถบรรทุกเทท้าย 10 ล้อ ', '83-5318', '017-56-0023', 2556, 0, 8, 'กองช่าง', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(98, 0, 1, 'HINO', 'HINO FM 8J', 'สเปรย์ยาง 6 ล้อ', '83-1156', '022-54-0001', 2554, 0, 10, 'กองช่าง', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(99, 0, 1, 'ISUZU', 'ISUZU FTR 34', 'รถเจาะบ่อบาดาล', '83-4426', '044-56-0002', 2556, 0, 8, ' สำนักปลัดฯ', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(100, 0, 2, 'ISUZU', 'ISUZU FTR 32', 'รถเจาะบ่อบาดาล', '83-5637', '044-37-0003', 2537, 0, 27, ' สำนักปลัดฯ', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(101, 0, 1, 'ISUZU', 'ISUZU FTR 34', 'บรรทุกติดตั้งเครนสลิง', '83-3323', '045-56-0001', 2556, 0, 8, ' สำนักปลัดฯ', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(102, 0, 1, 'ISUZU', 'ISUZU FTR 34', 'รถปรับสภาพพื้นผิวถนน', '83-4149', '048-56-0001', 2556, 0, 8, 'กองช่าง', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(103, 0, 2, 'ISUZU', 'ISUZU FTR 34', 'รถปรับสภาพพื้นผิวถนน', '83-4150', '048-56-0002', 2556, 0, 8, 'กองช่าง', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(104, 0, 3, 'HINO', 'HINO FM 8J', 'รถปรับสภาพพื้นผิวถนน', '83-1500', '017-55-0020', 2555, 0, 9, 'กองช่าง', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(105, 0, 4, 'HINO', 'HINO FM 8J', 'รถปรับสภาพพื้นผิวถนน', '83-1501', '017-55-0021', 2555, 0, 9, 'กองช่าง', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(106, 0, 1, 'ISUZU', 'ISUZU FTR 34', 'รถสุขาเคลื่อนที่', '83-4684', '050-56-0001', 2556, 0, 8, ' สำนักปลัดฯ', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(107, 0, 3, 'HINO ', 'FM2PK', 'รถเทรลเลอร์ 18 ล้อ', '84-3023', '013-63-0007', 2563, 0, 1, 'กองช่าง', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(108, 0, 4, 'HINO ', 'FM2PK', 'รถเทรลเลอร์ 18 ล้อ', '84-3025', '013-63-0008', 2563, 0, 1, 'กองช่าง', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(109, 0, 5, 'ISUZU', 'GXZ360', 'รถเทรลเลอร์ 18 ล้อ', '84-3228', '013-63-0009', 2563, 0, 1, 'กองช่าง', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(110, 0, 6, 'ISUZU', 'GXZ360', 'รถเทรลเลอร์ 18 ล้อ', '84-3229', '013-63-00010', 2563, 0, 1, 'กองช่าง', NULL, NULL, '', NULL, '2023-11-08 08:14:12', 0, 0, NULL),
(132, 0, NULL, 'MITSUBISHI', 'SUPAR', 'รถเทรลเลอร์ 18 ล้อ', 'mm-1234', '99+99+99', 2499, 1258470, NULL, 'กองช่าง', 'Dominic Connecto', '0999999999', '', 'โครตแพง', '2023-11-08 08:14:12', 0, 0, NULL),
(133, 0, NULL, 'CATTERPINRA', 'DSDE', 'รถเทรลเลอร์ 18 ล้อ', 'rfr1111111', '1+2+3+4+5+6', 2358, 10, NULL, 'กองช่าง', 'Dominic Connecto', '0987458258', '', 'โครตแพง', '2023-11-08 08:14:12', 0, 0, NULL),
(134, 0, NULL, 'SAKAI', 'DOGECHARGER', 'รถบรรทุกขยะ 4 ล้อ', 'doge123', '789/456/132', 2563, 300, NULL, 'กองยุทธศาสตร์ฯ', 'dominic conecto', '9825484686', '', '-', '2023-11-08 08:14:12', 0, 0, NULL),
(135, 2, NULL, 'DYNAPAC', 'CHALLENGER', 'รถบดล้อยาง', 'olo1595', '789/456/132', 2561, 900, NULL, 'กองช่าง', 'dominic conecto', '9876543210', 'image/machines/1782793969646202.jpg|image/machines/1782793969647040.jpg|image/machines/1782793969647794.jpg', 'tranfromer', '2023-11-17 00:07:00', 0, 0, '2023-11-17 00:07:00'),
(136, 1, NULL, 'HINO', 'AHAHAHAHA', 'รถบรรทุกน้ำ 10 ล้อ', 'CP-9999', '444-33-2222', 2543, 90000000, NULL, 'รร.สวนกุหลาบฯ', 'Uchiwa Itachi2', '8888888889', 'image/machines/1781986373942757.jpg|image/machines/1781986373943611.jpg', 'test machine2', '2023-11-16 04:10:56', 0, 1, '2023-11-15 21:10:56');

-- --------------------------------------------------------

--
-- Table structure for table `migrations`
--

CREATE TABLE `migrations` (
  `id` int(10) UNSIGNED NOT NULL,
  `migration` varchar(255) NOT NULL,
  `batch` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `migrations`
--

INSERT INTO `migrations` (`id`, `migration`, `batch`) VALUES
(1, '2014_10_12_000000_create_users_table', 1),
(2, '2014_10_12_100000_create_password_resets_table', 1),
(3, '2019_08_19_000000_create_failed_jobs_table', 1),
(4, '2019_12_14_000001_create_personal_access_tokens_table', 1);

-- --------------------------------------------------------

--
-- Table structure for table `password_resets`
--

CREATE TABLE `password_resets` (
  `email` varchar(255) NOT NULL,
  `token` varchar(255) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `personal_access_tokens`
--

CREATE TABLE `personal_access_tokens` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `tokenable_type` varchar(255) NOT NULL,
  `tokenable_id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) NOT NULL,
  `token` varchar(64) NOT NULL,
  `abilities` text DEFAULT NULL,
  `last_used_at` timestamp NULL DEFAULT NULL,
  `expires_at` timestamp NULL DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `smcar2`
--

CREATE TABLE `smcar2` (
  `id` int(11) NOT NULL,
  `user_id` tinyint(4) DEFAULT NULL,
  `group_code` int(11) DEFAULT NULL,
  `brand` varchar(255) DEFAULT NULL,
  `model` varchar(255) DEFAULT NULL,
  `type` varchar(255) DEFAULT NULL,
  `license` varchar(255) DEFAULT NULL,
  `code_machine` varchar(255) DEFAULT NULL,
  `year` int(11) DEFAULT NULL,
  `budget` float DEFAULT NULL,
  `old_use` int(11) DEFAULT NULL,
  `owner` varchar(255) DEFAULT NULL,
  `responsible_person` varchar(255) DEFAULT NULL,
  `phone` varchar(255) DEFAULT NULL,
  `path_img` text NOT NULL,
  `note` varchar(255) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `is_status` tinyint(4) DEFAULT NULL,
  `deleted` tinyint(4) DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `smcar2`
--

INSERT INTO `smcar2` (`id`, `user_id`, `group_code`, `brand`, `model`, `type`, `license`, `code_machine`, `year`, `budget`, `old_use`, `owner`, `responsible_person`, `phone`, `path_img`, `note`, `created_at`, `is_status`, `deleted`, `updated_at`) VALUES
(1, NULL, 1, 'MITSUBISHI', 'TRITON', 'รถกระบะ ตอนเดียว', 'บว-4007', '001-54-0091', 2554, 493800, -2554, 'กองช่าง', 'กฤษดา  ศิลปจาร์ย', '', '', '', NULL, 0, 0, NULL),
(2, NULL, 2, 'MITSUBISHI', 'TRITON', 'รถกระบะ ตอนเดียว', 'บว-4008', '001-54-0092', 2554, 493800, -2554, 'กองช่าง', 'สุรสิทธิ์ โพธิ์ไหม ', '0946081031', '', '', NULL, 0, 0, NULL),
(3, NULL, 3, 'MITSUBISHI', 'TRITON', 'รถกระบะ 4 ประตู', 'กธ-4539', '001-54-0086', 2554, 704800, -2554, 'กองช่าง', 'มาโนด  สีเหลี่ยม ', '0870878040', '', '', NULL, 0, 0, NULL),
(4, NULL, 4, 'MITSUBISHI', 'TRITON', 'รถกระบะ ตอนเดียว', 'บร-6372', '001-52-0069', 2552, 467000, -2552, 'กองช่าง', 'พนม  ฉวีทอง', '0850515345', '', '', NULL, 0, 0, NULL),
(5, NULL, 5, 'CHEVROLET', 'COLORADO', 'รถกระบะ 4 ประตู', 'กฉ-998', '001-48-0054', 2548, 843000, -2548, 'กองช่าง', 'ไพโรจน์  ปานอุดมลักษณ์', '', '', '2500 cc.', NULL, 0, 0, NULL),
(6, NULL, 6, 'MAZDA', 'FIGHTER', 'รถกระบะ 4 ประตู(มีหลังคา)', 'กจ-5852', '001-46-0046', 2546, 450000, -2546, 'กองช่าง', 'พีระ โกสีย์', '0638786676', '', '', NULL, 0, 0, NULL),
(7, NULL, 7, 'ISUZU', 'TFR', 'รถกระบะ 4 ประตู', 'ข-9718', '001-37-0034', 2537, 480000, -2537, 'กองช่าง', 'อนงค์ ปานดิษฐ์', '0864476067', '', '', NULL, 0, 0, NULL),
(8, NULL, 1, 'MITSUBISHI', 'TRITON', 'รถกระบะ 4 ประตู', 'กธ-5207', '001-54-0094', 2554, 732500, -2554, 'กองการเจ้าหน้าที่', 'ณัฐพงษ์  วินิจสร', '0821639737', '', '', NULL, 0, 0, NULL),
(9, NULL, 1, 'MITSUBISHI', 'L-200', 'รถกระบะ 4 ประตู', 'ม-0694', '001-57-0111', 2557, 150000, -2557, 'กองการศึกษาและวัฒนธรรม', '', '', '', 'โรงเรียนสวนกุหลาบฯ', NULL, 0, 0, NULL),
(10, NULL, 2, 'TOYOTA', 'COMMUTER', 'รถตู้', 'นค-4719', '001-57-0109', 2557, 1200000, -2557, 'กองการศึกษาและวัฒนธรรม', 'นิพัญน์  รอดสม', '0862012840', '', 'โรงเรียนสวนกุหลาบฯ', NULL, 0, 0, NULL),
(11, NULL, 3, 'TOYOTA', 'HIACE', 'รถตู้', 'นข-504', '001-57-0110', 2557, 800000, -2557, 'กองการศึกษาและวัฒนธรรม', '', '', '', 'โรงเรียนสวนกุหลาบฯ', NULL, 0, 0, NULL),
(12, NULL, 4, 'MITSUBISHI', 'TRITON', 'รถกระบะ 4 ประตู', 'กธ-7169', '001-54-0097', 2554, 704500, -2554, 'กองการศึกษาและวัฒนธรรม', 'มานพ  แสงเมือง', '0887809085 ', '', '', NULL, 0, 0, NULL),
(13, NULL, 5, 'MITSUBISHI', 'TRITON', 'รถกระบะ 4 ประตู', 'กท-247', '001-52-0073', 2552, 650000, -2552, 'กองการศึกษาและวัฒนธรรม', 'วทัญญู  แก้วทอง', '0918658650', '', '', NULL, 0, 0, NULL),
(14, NULL, 1, 'FORD', 'ไม่ได้ระบุรุ่นรถ', 'รถรับส่งนักท่องเที่ยว', ' -', '041-63-0007', 2563, 1278000, -2563, 'กองกิจการพาณิชย์', 'สิงห์  ศรีอินทร์', '0831545590', '', '', NULL, 0, 0, NULL),
(15, NULL, 2, 'TOYOTA', '', 'รถราง', '-', '041-59-0006', 2559, 990000, -2559, 'กองกิจการพาณิชย์', 'สิงห์  ศรีอินทร์', '0831545590', '', ' รถชมวิว  2000 cc', NULL, 0, 0, NULL),
(16, NULL, 3, 'MITSUBISHI', 'TRITON', 'รถกระบะ 4 ประตู', 'กม-8053', '001-58-0116', 2558, 786500, -2558, 'กองกิจการพาณิชย์', 'ณัฐพงษ์  อุ่ยสันติศักดิ์', '0817049177', '', 'เกียร์อัตโนมัติ', NULL, 0, 0, NULL),
(17, NULL, 4, 'MITSUBISHI', 'TRITON', 'รถกระบะ 4 ประตู', 'กธ-5801', '001-54-0095', 2554, 732500, -2554, 'กองกิจการพาณิชย์', 'ณัฐพงษ์  อุ่ยสันติศักดิ์', '0817049177', '', '', NULL, 0, 0, NULL),
(18, NULL, 5, 'MITSUBISHI', 'TRITON', 'รถกระบะ 4 ประตู', 'บล-922', '001-52-0077', 2552, 520000, -2552, 'กองกิจการพาณิชย์', 'สถิตย์ พิมพา ', '0946134400', '', '', NULL, 0, 0, NULL),
(19, NULL, 6, 'SUZUKI', 'CARRY', 'รถกระบะ ตอนเดียว', 'บล-1449', '001-52-0079', 2552, 450000, -2552, 'กองกิจการพาณิชย์', 'วิรัช สายแขก', '0829041272', '', 'เครื่องยนต์เบนซิน', NULL, 0, 0, NULL),
(20, NULL, 7, 'MITSUBISHI', 'TRITON', 'รถกระบะ 4 ประตู', 'กต-9312', '001-52-0070', 2552, 649000, -2552, 'กองกิจการพาณิชย์', 'ฝนทิพย์  แสนพรหม', '0869391169', '', '', NULL, 0, 0, NULL),
(21, NULL, 8, 'MITSUBISHI', 'TRITON', 'รถกระบะ 4 ประตู', 'กต-9603', '001-52-0071', 2552, 650000, -2552, 'กองกิจการพาณิชย์', 'นางเกษณี จันทร์หอม', '0848143018', '', '', NULL, 0, 0, NULL),
(22, NULL, 9, 'EVT', 'CHALET', 'รถพลังงานไฟฟ้า', ' -', '041-52-0004', 2552, 800000, -2552, 'กองกิจการพาณิชย์', 'วิรัช สายแขก', '0829041272', '', '', NULL, 0, 0, NULL),
(23, NULL, 10, 'EVT', 'CHALET', 'รถพลังงานไฟฟ้า', ' -', '041-52-0005', 2552, 800000, -2552, 'กองกิจการพาณิชย์', 'ระเบียบ  คลังสิน', '0878445324', '', '', NULL, 0, 0, NULL),
(24, NULL, 11, 'EVT', 'CHALET', 'รถพลังงานไฟฟ้า', ' -', '041-51-0001', 2551, 660000, -2551, 'กองกิจการพาณิชย์', 'อุดม  รอดประเสริฐ', '0643467912', '', '', NULL, 0, 0, NULL),
(25, NULL, 12, 'EVT', 'CHALET', 'รถพลังงานไฟฟ้า', ' -', '041-51-0003', 2551, 660000, -2551, 'กองกิจการพาณิชย์', 'สิงห์  ศรีอินทร์', '0831545590', '', '', NULL, 0, 0, NULL),
(26, NULL, 13, 'MITSUBISHI', 'TRITON', 'รถกระบะ แบบแค็บ', 'บย-6770', '001-50-0067', 2550, 519000, -2550, 'กองกิจการพาณิชย์', 'นายภัคธนา อ่ำสำโรง', '0845067152', '', '', NULL, 0, 0, NULL),
(27, NULL, 14, 'MITSUBISHI', 'TRITON', 'รถกระบะ 4 ประตู', 'กต-3252', '001-50-0065', 2550, 779500, -2550, 'กองกิจการพาณิชย์', 'จุทารัตน์  ทองหยิบ', '0818872495', '', 'แบบยกสูง', NULL, 0, 0, NULL),
(28, NULL, 15, 'MAZDA', 'FIGHTER', 'รถกระบะ 4 ประตู', 'กจ-2211', '001-46-0045', 2546, 450000, -2546, 'กองกิจการพาณิชย์', 'ณัฐพงษ์  อุ่ยสันติศักดิ์', '0817409177', '', '', NULL, 0, 0, NULL),
(29, NULL, 16, 'MITSUBISHI', 'STRADA', 'รถกระบะ 4 ประตู(มีหลังคา)', 'นค-857', '001-43-0041', 2542, 680000, -2542, 'กองกิจการพาณิชย์', 'ณัฐพงษ์  อุ่ยสันติศักดิ์', '0878464196', '', '', NULL, 0, 0, NULL),
(30, NULL, 1, 'MITSUBISHI', 'TRITON', 'รถกระบะ 4 ประตู', 'กธ-2327', '001-54-0081', 2554, 779500, -2554, 'กองคลัง', 'นิรันด์ มาลาเพชร', '0833317846', '', '', NULL, 0, 0, NULL),
(31, NULL, 2, 'MAZDA', 'BT-50', 'รถกระบะ 4 ประตู', 'กต-9690', '001-52-0072', 2552, 534000, -2552, 'กองคลัง', 'นิรันด์ มาลาเพชร', '0833317846', '', '', NULL, 0, 0, NULL),
(32, NULL, 3, 'MAZDA', 'FIGHTER', 'รถกระบะ 4 ประตู', 'กจ-7655', '001-47-0049', 2547, 515000, -2547, 'กองคลัง', 'นิรันด์ มาลาเพชร', '0833317846', '', '', NULL, 0, 0, NULL),
(33, NULL, 1, 'MITSUBISHI', 'PAJERO', 'MPV ', 'กก-8888', '001-59-0119', 2559, 1196000, -2559, 'กองช่าง', '', '', '', '', NULL, 0, 0, NULL),
(34, NULL, 2, 'CHEVROLET', 'TRAILBLAZER', 'MPV ', 'กม-8841', '001-58-0118', 2558, 1480000, -2558, 'กองช่าง', '', '', '', '', NULL, 0, 0, NULL),
(35, NULL, 1, 'MITSUBISHI', 'TRITON', 'รถกระบะ ตอนเดียว', 'ผก-3026', '001-58-0115', 2558, 493000, -2558, 'กองช่าง', 'กฤษณะ  ตาบุตร', '0869360778', '', '', NULL, 0, 0, NULL),
(36, NULL, 2, 'MITSUBISHI', 'TRITON', 'รถกระบะ ตอนเดียว', 'บห-2726', '001-56-0100', 2556, 493000, -2556, 'กองช่าง', 'สาธิต  บัวบาน', '0846198920', '', '', NULL, 0, 0, NULL),
(37, NULL, 3, 'MITSUBISHI', 'TRITON', 'รถกระบะ 4 ประตู', 'กพ-126', '001-56-0104', 2556, 848500, -2556, 'กองช่าง', 'ศศิพงค์  ธนพงษ์ภัทร์ภาณุ', '0988266241', '', '', NULL, 0, 0, NULL),
(38, NULL, 4, 'MITSUBISHI', 'TRITON', 'รถกระบะ 4 ประตู', 'กฉ-989', '001-56-0106', 2556, 848500, -2556, 'กองช่าง', 'ปรัชญา  ปัญญาอ่อง', '0815342783', '', 'เกียร์อัตโนมัติ', NULL, 0, 0, NULL),
(39, NULL, 5, 'MITSUBISHI', 'TRITON', 'รถกระบะ 4 ประตู', 'กต-3250', '001-50-0066', 2550, 779500, -2550, 'กองช่าง', 'ปราโมทย์  หัตถบรูณ์', '0867802800', '', 'แบบยกสูง', NULL, 0, 0, NULL),
(40, NULL, 6, 'CHEVROLET', 'COLORADO', 'รถกระบะ 4 ประตู', 'กจ-9828', '001-48-0050', 2548, 694000, -2548, 'กองช่าง', 'ศรายุทธ  ล้อมลื่น', '0820581724', '', '2500 cc.', NULL, 0, 0, NULL),
(41, NULL, 7, 'ISUZU', 'TFR', 'รถกระบะ ตอนเดียว', 'ผ-9089', '001-37-0035', 2537, 300000, -2537, 'กองช่าง', 'สมชาย  รัศมี', '0827671530', '', '', NULL, 0, 0, NULL),
(42, NULL, 8, 'ISUZU', 'TFR', 'รถกระบะ 4 ประตู', 'กฉ-9443', '001-35-0031', 2535, 460000, -2535, 'กองช่าง', 'สมพงษ์  ชัณยะมาตร์', '0896776472', '', '', NULL, 0, 0, NULL),
(43, NULL, 9, 'ISUZU', 'TFR', 'รถกระบะ แบบแค็บ', 'ป-4760', '001-34-0022', 2534, 324000, -2534, 'กองช่าง', 'พีรพล  แสงโชติ', '0845970544', '', '', NULL, 0, 0, NULL),
(44, NULL, 10, 'TOYOTA', 'HERO', 'รถกระบะ ตอนเดียว', 'บค-9325', '001-32-0019', 2532, 283000, -2532, 'กองช่าง', 'อธิคม  นิลเนตร์', '0818887470', '', '', NULL, 0, 0, NULL),
(45, NULL, 11, 'TOYOTA', 'HERO', 'รถกระบะ ตอนเดียว', 'ม-0828', '001-27-0010', 2527, 159500, -2527, 'กองช่าง', 'สุนทร  พรมสี', '0848194133', '', '', NULL, 0, 0, NULL),
(46, NULL, 12, 'TOYOTA', 'HERO', 'รถกระบะ ตอนเดียว', 'บม-6615', '001-26-0009', 2526, 159500, -2526, 'กองช่าง', 'ธวัชชัย  กอนเอียม', '0870685234', '', '', NULL, 0, 0, NULL),
(47, NULL, 13, 'NISSAN', 'NAVARA', 'รถกระบะ ตอนเดียว', 'ผฉ 2447', '001-64-0123', 2564, 464000, -2564, 'กองช่าง', 'ธวัชชัย  กอนเอียม', '0870685234', '', '', NULL, 0, 0, NULL),
(48, NULL, 14, 'NISSAN', 'NAVARA', 'รถกระบะ ตอนเดียว', 'ผฉ 2448', '001-64-0123', 2564, 464000, -2564, 'กองช่าง', 'ธวัชชัย  กอนเอียม', '0870685234', '', '', NULL, 0, 0, NULL),
(49, NULL, 1, 'MITSUBISHI', 'TRITON', 'รถกระบะ 4 ประตู', 'กง-6116', '001-50-0061', 2550, 685500, -2550, 'กองช่าง', 'สุภาพ เกตุสุภะ', '0993859396', '', '', NULL, 0, 0, NULL),
(50, NULL, 1, 'MITSUBISHI', 'TRITON', 'รถกระบะ 4 ประตู', 'กร-3069', '001-60-0120', 2560, 893000, -2560, 'กองช่าง', '', '', '', 'เกียร์อัตโนมัติ 4x4', NULL, 0, 0, NULL),
(51, NULL, 2, 'MITSUBISHI', 'TRITON', 'รถกระบะ ตอนเดียว', 'บห-2725', '001-56-0099', 2556, 493000, -2556, 'กองช่าง', 'นันทยศ  ทองสกุล', '0951261333', '', '', NULL, 0, 0, NULL),
(52, NULL, 3, 'MITSUBISHI', 'TRITON', 'รถกระบะ ตอนเดียว', 'บห-2728', '001-56-0101', 2556, 493000, -2556, 'กองช่าง', 'กิตติวัฒน์ เลิศธนวิรัตน์', '0935965953', '', '', NULL, 0, 0, NULL),
(53, NULL, 4, 'MITSUBISHI', 'TRITON', 'รถกระบะ 4 ประตู', 'กธ-2303', '001-54-0080', 2554, 699000, -2554, 'กองช่าง', '', '0851987272', '', '', NULL, 0, 0, NULL),
(54, NULL, 5, 'MITSUBISHI', 'TRITON', 'รถกระบะ 4 ประตู', 'กธ-4538', '001-54-0087', 2554, 704800, -2554, 'กองช่าง', 'กิตติวัฒน์ เลิศธนวิรัตน์', '0935965953', '', '', NULL, 0, 0, NULL),
(55, NULL, 6, 'MITSUBISHI', 'TRITON', 'รถกระบะ 4 ประตู', 'กธ-4536', '001-54-0088', 2554, 704800, -2554, 'กองช่าง', '', '0818881878', '', '', NULL, 0, 0, NULL),
(56, NULL, 7, 'MITSUBISHI', 'TRITON', 'รถกระบะ 4 ประตู', 'กธ-4543', '001-54-0089', 2554, 704800, -2554, 'กองช่าง', 'กิตติวัฒน์ เลิศธนวิรัตน์', '0935965953', '', '', NULL, 0, 0, NULL),
(57, NULL, 8, 'CHEVROLET', 'COLORADO', 'รถกระบะ 4 ประตู', 'กพ-2342', '001-48-0055', 2548, 843000, -2548, 'กองช่าง', 'สุเมธ  สาสะกุล', '0873169631', '', '2500 cc.', NULL, 0, 0, NULL),
(58, NULL, 9, 'MAZDA', 'FIGHTER', 'รถกระบะ 4 ประตู(มีหลังคา)', 'กจ-7656', '001-47-0048', 2547, 515000, -2547, 'กองช่าง', 'นันทยศ  ทองสกุล', '0951261333', '', '', NULL, 0, 0, NULL),
(59, NULL, 10, 'MAZDA', 'FIGHTER', 'รถกระบะ 4 ประตู(มีหลังคา)', 'กจ-5851', '001-46-0047', 2546, 450000, -2546, 'กองช่าง', 'นันทยศ  ทองสกุล', '0951261333', '', '', NULL, 0, 0, NULL),
(60, NULL, 11, 'ISUZU', 'TFR', 'รถกระบะ 4 ประตู', 'ย-0298', '001-35-0027', 2535, 460000, -2535, 'กองช่าง', 'สุเมธ  สาสะกุล', '0873169631', '', '', NULL, 0, 0, NULL),
(61, NULL, 1, 'MITSUBISHI', 'TRITON', 'รถกระบะ 4 ประตู', 'กบ-9910', '001-56-0102', 2556, 785500, -2556, 'กองพัสดุและทรัพย์สิน', 'ธนาธิป  ไม้สน', '0872060624', '', 'เกียร์อัตโนมัติ', NULL, 0, 0, NULL),
(62, NULL, 1, 'MITSUBISHI', 'TRITON', 'รถกระบะ 4 ประตู', 'กม-3511', '001-58-0114', 2558, 848500, -2558, 'กองยุทธศาสตร์ฯ', 'จารุนันท์  สุขอยู่', '0612682929', '', 'เกียร์อัตโนมัติ', NULL, 0, 0, NULL),
(63, NULL, 1, 'MITSUBISHI', 'TRITON', 'รถกระบะ 4 ประตู', 'กม-8054', '001-58-0117', 2558, 786500, -2558, 'กองสวัสดิการสังคม', 'จ.ส.ท.บรรหาญ บำเพ็ญรัตน์', '0858747436', '', 'เกียร์อัตโนมัติ', NULL, 0, 0, NULL),
(64, NULL, 2, 'MITSUBISHI', 'TRITON', 'รถกระบะ 4 ประตู', 'กธ-4541', '001-54-0090', 2554, 704800, -2554, 'กองสวัสดิการสังคม', 'จ.ส.ท.บรรหาญ บำเพ็ญรัตน์', '0858747436', '', '', NULL, 0, 0, NULL),
(65, NULL, 3, 'TOYOTA', 'VIGO', 'รถกระบะ 4 ประตู', 'กท-7765', '042-53-0001', 2553, 1370000, -2553, 'กองสวัสดิการสังคม', 'ประพัฒน์พงษ์  กาญจนวิเชียร', '0895030672', '', 'บ้านพักคนชราเขาบ่อแก้ว', NULL, 0, 0, NULL),
(66, NULL, 4, 'MITSUBISHI', 'TRITON', 'รถกระบะ 4 ประตู', 'กท-1087', '001-52-0074', 2552, 650000, -2552, 'กองสวัสดิการสังคม', 'ประพัฒน์พงษ์  กาญจนวิเชียร', '0895030672', '', '', NULL, 0, 0, NULL),
(67, NULL, 5, 'HYUNDAI', 'H1', 'รถตู้', 'นค-3918', '001-52-0075', 2552, 1040000, -2552, 'กองสวัสดิการสังคม', 'ประพัฒน์พงษ์  กาญจนวิเชียร', '0895030672', '', '', NULL, 0, 0, NULL),
(68, NULL, 6, 'MITSUBISHI', 'TRITON', 'รถกระบะ 4 ประตู', 'บย-133', '001-50-0060', 2550, 532000, -2550, 'กองสวัสดิการสังคม', 'ประพัฒน์พงษ์  กาญจนวิเชียร', '0895030672', '', '', NULL, 0, 0, NULL),
(69, NULL, 7, 'MITSUBISHI', 'STRADA', 'รถกระบะ ตอนเดียว', 'กฉ-990', '001-48-0053', 2548, 617000, -2548, 'กองสวัสดิการสังคม', 'จ.ส.ท.บรรหาญ บำเพ็ญรัตน์', '0858747436', '', '', NULL, 0, 0, NULL),
(70, NULL, 1, 'MITSUBISHI', 'TRITON', 'รถกระบะ 4 ประตู', 'กพ-6534', '001-57-0107', 2557, 787000, -2557, 'สำนักงานเลขานุการฯ', 'วิรัช  อุปภา', '0862156178', '', 'เกียร์อัตโนมัติ', NULL, 0, 0, NULL),
(71, NULL, 2, 'MITSUBISHI', 'TRITON', 'รถกระบะ 4 ประตู', 'กธ-5802', '001-54-0096', 2554, 704500, -2554, 'สำนักงานเลขานุการฯ', 'วิรัช  อุปภา', '0862156178', '', '', NULL, 0, 0, NULL),
(72, NULL, 1, 'TOYOTA', 'COMMUTER', 'รถตู้', 'นค-5378', '001-57-0112', 2557, 1224000, -2557, ' สำนักปลัดฯ', 'ณัฐธนภัทร์  ทองอร่าม ', '0812838813', '', '', NULL, 0, 0, NULL),
(73, NULL, 2, 'TOYOTA', 'COMMUTER', 'รถตู้', 'นค-5380', '001-57-0113', 2557, 1224000, -2557, ' สำนักปลัดฯ', 'บูเบศ  เรืองเที่ยง', '0845917338', '', '', NULL, 0, 0, NULL),
(74, NULL, 3, 'MITSUBISHI', 'TRITON', 'รถกระบะ 4 ประตู', 'กบ-9817', '001-56-0103', 2556, 785500, -2556, ' สำนักปลัดฯ', 'ณัฐธนภัทร์  ทองอร่าม ', '0812838813', '', 'รองผู้ว่า จว.นว.', NULL, 0, 0, NULL),
(75, NULL, 4, 'TOYOTA', 'COMMUTER', 'รถตู้', 'นค-5223', '001-56-0105', 2556, 1150000, -2556, ' สำนักปลัดฯ', 'สุภชัย  ชนะหาญ ', '0979359976 ', '', '', NULL, 0, 0, NULL),
(76, NULL, 5, 'MITSUBISHI', 'TRITON', 'รถกระบะ 4 ประตู', 'กธ-8809', '001-55-0098', 2555, 704500, -2555, ' สำนักปลัดฯ', 'บรรจง  ศรีธรรมกิจจา', '0900265810', '', '', NULL, 0, 0, NULL),
(77, NULL, 6, 'MITSUBISHI', 'TRITON', 'รถกระบะ 4 ประตู', 'กธ-5206', '001-54-0093', 2554, 732500, -2554, ' สำนักปลัดฯ', 'สามารถ  คล้ายทิม', '0846191669', '', '', NULL, 0, 0, NULL),
(78, NULL, 7, 'TOYOTA', 'COMMUTER', 'รถตู้', 'นค-4472', '001-54-0082', 2554, 1190000, -2554, ' สำนักปลัดฯ', 'วชิรวิชญ์  ธัญศิษฐ์ธนากุล ', '0875727235', '', '', NULL, 0, 0, NULL),
(79, NULL, 8, 'TOYOTA', 'VENTURY', 'รถตู้', 'นค-1818', '001-52-0076', 2552, 1288000, -2552, ' สำนักปลัดฯ', 'บูเบศ  เรืองเที่ยง', '0845917338', '', 'เครื่องยนต์เบนซิน', NULL, 0, 0, NULL),
(80, NULL, 9, 'FORD', 'EVEREST', 'MPV', 'กง-5758', '001-50-0063', 2550, 1115000, -2550, ' สำนักปลัดฯ', 'พรพิพัฒน์  อินทยาภรณ์ ', '0906903389', '', '', NULL, 0, 0, NULL),
(81, NULL, 10, 'MITSUBISHI', 'TRITON', 'รถกระบะ 4 ประตู', 'กก-1221', '001-50-0062', 2550, 685500, -2550, ' สำนักปลัดฯ', 'วชิรวิชญ์  ธัญศิษฐ์ธนากุล ', '0875727235', '', '', NULL, 0, 0, NULL),
(82, NULL, 11, 'TOYOTA', 'COMMUTER', 'รถตู้', 'นข-8', '001-48-0056', 2548, 1260000, -2548, ' สำนักปลัดฯ', 'ดำรงค์ศักดิ์  สุขโพธิวงศ์', ' 0847778223', '', '', NULL, 0, 0, NULL),
(83, NULL, 12, 'TOYOTA', 'CAMRY', 'รถเก๋ง', 'กจ-4455', '001-45-0043', 2545, 1348000, -2545, ' สำนักปลัดฯ', 'ณัฐธนภัทร์  ทองอร่าม ', '0812838813', '', '', NULL, 0, 0, NULL),
(84, NULL, 13, 'TOYOTA', 'HIACE - SUPER WAGON 2.4 MT', 'รถตู้', 'นค-1881', '001-45-0044', 2545, 1148000, -2545, ' สำนักปลัดฯ', 'ชาคร สุรเดช', '0878451447', '', 'เครื่องยนต์เบนซิน', NULL, 0, 0, NULL),
(85, NULL, 14, 'TOYOTA', 'CAMRY', 'รถเก๋ง', 'กย-5168', '001-43-0040', 2543, 650000, -2543, ' สำนักปลัดฯ', 'ทศพล  แก้วสุข', '0890933623', '', 'เกียร์อัตโนมัติ', NULL, 0, 0, NULL),
(86, NULL, 1, 'MITSUBISHI', 'TRITON', 'รถกระบะ 4 ประตู', 'กธ-4542', '001-54-0083', 2554, 704800, -2554, ' สำนักปลัดฯ', 'ส.อ. นเรศ ศุระศรางค์', '0918404971', '', '', NULL, 0, 0, NULL),
(87, NULL, 2, 'MITSUBISHI', 'TRITON', 'รถกระบะ 4 ประตู', 'กธ-4537', '001-54-0085', 2554, 704800, -2554, ' สำนักปลัดฯ', 'เสด็จ  สีแดง', '0872043511', '', '', NULL, 0, 0, NULL),
(88, NULL, 3, 'MITSUBISHI', 'TRITON', 'รถกระบะ 4 ประตู', 'กต-3792', '001-51-0068', 2551, 777000, -2551, ' สำนักปลัดฯ', 'ณัฐพล  หนูพราย', '081168 8110', '', '3200 cc.', NULL, 0, 0, NULL),
(89, NULL, 4, 'MITSUBISHI', 'STRADA', 'รถกระบะ 4 ประตู', 'กง-6435', '001-43-0042', 2543, 550000, -2543, ' สำนักปลัดฯ', 'ธีรพันธ์  ศรีเวียง', '0810395028', '', '', NULL, 0, 0, NULL),
(90, NULL, 1, 'MITSUBISHI', 'TRITON', 'รถกระบะ 4 ประตู', 'กพ-6532', '001-57-0108', 2557, 787000, -2557, 'หน่วยตรวจสอบภายใน', 'ส.อ. อุเทน พ่วงเฟื่อง', '0892689536', '', 'เกียร์อัตโนมัติ', NULL, 0, 0, NULL),
(184, 1, NULL, 'AUDI', 'TEST', 'ไม่ได้ระบุประเภท', 'AP 2543', '01513215125', 2566, 5000000, NULL, 'กองยุทธศาสตร์ฯ', 'The Peter', '0984568465', 'image/cars/1781786105686021.jpg|image/cars/1781786105686474.png|image/cars/1781786105686740.png|image/cars/1781786105686989.jpg|image/cars/1781786105687228.png|image/cars/1781786105687460.png|image/cars/1781786105687684.png', 'Test', '2023-11-05 21:07:26', 0, 0, NULL),
(185, 1, NULL, 'BMW', 'TEST2', 'รถเก๋ง', 'PC 1420', '000-000000', 2567, 999999, NULL, 'กองกิจการพาณิชย์', 'The Test', '0698765432', 'image/cars/1781870078650473.jpg|image/cars/1781870078651364.jpg|image/cars/1781870078651908.jpg|image/cars/1781870078652436.jpg|image/cars/1781870078652973.jpg|image/cars/1781870078653493.jpg|image/cars/1781870078654322.jpg', 'Note Test Data', '2023-11-06 19:22:09', 0, 0, NULL),
(186, 1, NULL, 'BMW', 'Z4', 'รถเก๋ง', 'kid 1412', '000-123456789', 2568, 1234570000, NULL, 'กองช่าง', 'The Test3', '0123456789', 'image/cars/1781967445482210.jpg|image/cars/1781967445483092.jpg', 'Hello World', '2023-11-07 21:09:45', 0, 1, '2023-11-15 21:56:10'),
(187, 1, NULL, 'CHEVROLET', 'CAMERO', 'รถเก๋ง', 'OP 5633', '222-666-9999', 2543, 875521, NULL, 'กองคลัง', 'Shisua', '9999999999', 'image/cars/1781967299402048.jpg|image/cars/1781967299402928.jpg|image/cars/1781967299403482.jpg|image/cars/1781967299404080.jpg', 'test2 test2 test2 test2 test2', '2023-11-07 21:07:26', 0, 1, '2023-11-15 01:49:29'),
(188, 1, NULL, 'HYUNDAI', 'H1', 'รถตู้', 'ds6969', '23456-5465', 2566, 8000000, NULL, 'รร.สวนกุหลาบฯ', 'Tsuneo', '056279442', 'image/cars/1781964940419063.jpg|image/cars/1781964940420258.jpg|image/cars/1781964940421211.jpg', 'fd1245', '2023-11-07 20:29:56', 0, 1, '2023-11-15 01:42:59');

-- --------------------------------------------------------

--
-- Table structure for table `truck`
--

CREATE TABLE `truck` (
  `id` int(11) NOT NULL,
  `user_id` tinyint(4) NOT NULL,
  `group_code` tinyint(4) DEFAULT NULL,
  `brand` varchar(255) DEFAULT NULL,
  `model` varchar(255) DEFAULT NULL,
  `hp_kw` varchar(255) DEFAULT NULL,
  `type` varchar(255) DEFAULT NULL,
  `license` varchar(255) DEFAULT NULL,
  `code_machine` varchar(255) DEFAULT NULL,
  `year` int(11) DEFAULT NULL,
  `budget` float DEFAULT NULL,
  `old_use` int(11) DEFAULT NULL,
  `owner` varchar(255) DEFAULT NULL,
  `responsible_person` varchar(255) DEFAULT NULL,
  `phone` varchar(255) DEFAULT NULL,
  `path_img` text NOT NULL,
  `note` varchar(255) DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `is_status` tinyint(4) DEFAULT NULL,
  `deleted` tinyint(4) DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `truck`
--

INSERT INTO `truck` (`id`, `user_id`, `group_code`, `brand`, `model`, `hp_kw`, `type`, `license`, `code_machine`, `year`, `budget`, `old_use`, `owner`, `responsible_person`, `phone`, `path_img`, `note`, `created_at`, `is_status`, `deleted`, `updated_at`) VALUES
(1, 0, 1, 'MITSUBISHI ', 'FN526', '170 แรงม้า', 'รถบรรทุกเทท้าย 10 ล้อ', '81-7802', '017-29-0007', 2529, 740000, 35, 'กองช่าง', '', '', '', '', '2023-11-08 08:16:20', 0, 0, NULL),
(2, 0, 1, 'MITSUBISHI ', 'FN526', '170 แรงม้า', 'รถบรรทุกเทท้าย 10 ล้อ', '81-7790', '017-29-0008', 2529, 740000, 35, 'กองช่าง', '', '', '', '', '2023-11-08 08:16:20', 0, 0, NULL),
(3, 0, 1, 'NISSAN ', 'CW 30', '225 แรงม้า', 'รถบรรทุกเทท้าย 10 ล้อ', '81-7785', '017-33-0009', 2533, 1420000, 31, 'กองช่าง', '', '', '', '', '2023-11-08 08:16:20', 0, 0, NULL),
(4, 0, 1, 'HINO ', 'FM 227', '220 แรงม้า', 'รถบรรทุกเทท้าย 10 ล้อ', '81-7784', '017-35-0010', 2535, 1395000, 29, 'กองช่าง', '', '', '', '', '2023-11-08 08:16:20', 0, 0, NULL),
(5, 0, 1, 'HINO ', 'FM 1M', '220 แรงม้า', 'รถบรรทุกเทท้าย 10 ล้อ', '81-7782', '017-37-0011', 2537, 1647000, 27, 'กองช่าง', '', '', '', '', '2023-11-08 08:16:20', 0, 0, NULL),
(6, 0, 1, 'MITSUBISHI ', 'FN527', '220 แรงม้า', 'รถบรรทุกเทท้าย 10 ล้อ', '81-7781', '017-37-0012', 2537, 1647000, 27, 'กองช่าง', '', '', '', '', '2023-11-08 08:16:20', 0, 0, NULL),
(7, 0, 1, 'HINO ', 'FM 8J', '251 แรงม้า', 'รถบรรทุกเทท้าย 10 ล้อ', '83-1154', '017-54-0018', 2554, 3498500, 10, 'กองช่าง', '', '', '', '', '2023-11-08 08:16:20', 0, 0, NULL),
(8, 0, 1, 'HINO ', 'FM 8J', '251 แรงม้า', 'รถบรรทุกเทท้าย 10 ล้อ', '83-1155', '017-54-0019', 2554, 3498500, 10, 'กองช่าง', '', '', '', '', '2023-11-08 08:16:20', 0, 0, NULL),
(9, 0, 1, 'ISUZU', 'FVZ 34P', '240 แรงม้า', 'รถบรรทุกเทท้าย 10 ล้อ', '83-5317', '017-56-0022', 2556, 3490000, 8, 'กองช่าง', '', '', '', '', '2023-11-08 08:16:20', 0, 0, NULL),
(10, 0, 1, 'ISUZU', 'FVZ 34P', '240 แรงม้า', 'รถบรรทุกเทท้าย 10 ล้อ', '83-5318', '017-56-0023', 2556, 3490000, 8, 'กองช่าง', '', '', '', '', '2023-11-08 08:16:20', 0, 0, NULL),
(11, 0, 2, 'MITSUBISHI', 'FN526', '160 แรงม้า', 'รถบรรทุกน้ำ 10 ล้อ', '83-6578', '006-34-0006', 2534, 1670000, 30, 'กองช่าง', '', '', '', '', '2023-11-08 08:16:20', 0, 0, NULL),
(12, 0, 2, 'MITSUBISHI', 'FN526', '160 แรงม้า', 'รถบรรทุกน้ำ 10 ล้อ', '83-6579', '006-34-0007', 2534, 1670000, 30, 'กองกิจการพาณิชย์', '', '', '', '', '2023-11-08 08:16:20', 0, 0, NULL),
(13, 0, 2, 'ISUZU ', 'FVZ 12', '175 แรงม้า', 'รถบรรทุกน้ำ 10 ล้อ', '81-7786', '006-35-0008', 2535, 1418000, 29, 'กองช่าง', '', '', '', '', '2023-11-08 08:16:20', 0, 0, NULL),
(14, 0, 2, 'ISUZU ', 'FVZ 12', '175 แรงม้า', 'รถบรรทุกน้ำ 10 ล้อ', '81-7787', '006-35-0009', 2535, 1050000, 29, 'กองช่าง', '', '', '', '', '2023-11-08 08:16:20', 0, 0, NULL),
(15, 0, 2, 'ISUZU ', 'FVZ 12', '175 แรงม้า', 'รถบรรทุกน้ำ 10 ล้อ', '81-7788', '006-35-0010', 2535, 1050000, 29, 'กองช่าง', '', '', '', '', '2023-11-08 08:16:20', 0, 0, NULL),
(16, 0, 2, 'ISUZU ', 'FVZ 12', '175 แรงม้า', 'รถบรรทุกน้ำ 10 ล้อ', '81-7789', '006-35-0011', 2535, 1050000, 29, 'กองช่าง', '', '', '', '', '2023-11-08 08:16:20', 0, 0, NULL),
(17, 0, 2, 'ISUZU ', 'FVZ 33', '200 แรงม้า', 'รถบรรทุกน้ำ 10 ล้อ', 'บม-3290', '006-49-0016', 2549, 3490500, 15, 'สำนักปลัดฯ', '', '', '', '', '2023-11-08 08:16:20', 0, 0, NULL),
(18, 0, 2, 'ISUZU ', 'FVZ 33', '200 แรงม้า', 'รถบรรทุกน้ำ 10 ล้อ', 'บม-3291', '006-49-0017', 2549, 3490500, 15, 'สำนักปลัดฯ', '', '', '', '', '2023-11-08 08:16:20', 0, 0, NULL),
(19, 0, 2, 'ISUZU ', 'FVZ 33', '200 แรงม้า', 'รถบรรทุกน้ำ 10 ล้อ', 'บย-280', '006-50-0018', 2550, 3470000, 14, 'สำนักปลัดฯ', '', '', '', '', '2023-11-08 08:16:20', 0, 0, NULL),
(20, 0, 2, 'ISUZU ', 'FVZ 34P', '240 แรงม้า', 'รถบรรทุกน้ำ 10 ล้อ', 'บษ-4842', '006-55-0019', 2555, 3990000, 9, 'สำนักปลัดฯ', '', '', '', '', '2023-11-08 08:16:20', 0, 0, NULL),
(21, 0, 2, 'ISUZU ', 'FVZ 34P', '240 แรงม้า', 'รถบรรทุกน้ำ 10 ล้อ', 'บห-5575', '006-56-0020', 2556, 3984000, 8, 'กองช่าง', '', '', '', '', '2023-11-08 08:16:20', 0, 0, NULL),
(22, 0, 2, 'ISUZU ', 'FVZ 34P', '240 แรงม้า', 'รถบรรทุกน้ำ 10 ล้อ', '83-8503', '006-59-0021', 2559, 0, 5, 'สำนักปลัดฯ', '', '', '', '', '2023-11-08 08:16:20', 0, 0, NULL),
(23, 0, 3, 'HINO', 'KL-300', '150 แรงม้า', 'รถบรรทุกน้ำ 6 ล้อ', 'อก.11', '006-22-0004', 2522, 300000, 42, 'กองช่าง', '', '', '', '', '2023-11-08 08:16:20', 0, 0, NULL),
(24, 0, 3, 'ISUZU', 'SBR ', '170 แรงม้า', 'รถบรรทุกน้ำ 6 ล้อ', 'ทถ.14', '006-22-0005', 2525, 0, 39, 'กองกิจการพาณิชย์', '', '', '', 'รับโอนจากทางหลวงท้องถิ่น', '2023-11-08 08:16:20', 0, 0, NULL),
(25, 0, 3, 'MITSUBISHI', 'FK455', '160 แรงม้า', 'รถบรรทุกน้ำ 6 ล้อ', '82-2376', '006-47-0012', 2547, 0, 17, 'กองช่าง', '', '', '', 'รับโอนจากกรมส่งเสริมการเกษตร', '2023-11-08 08:16:20', 0, 0, NULL),
(26, 0, 3, 'MITSUBISHI', 'FK455', '160 แรงม้า', 'รถบรรทุกน้ำ 6 ล้อ', '82-2378', '006-47-0013', 2547, 0, 17, 'กองช่าง', '', '', '', 'รับโอนจากกรมส่งเสริมการเกษตร', '2023-11-08 08:16:20', 0, 0, NULL),
(27, 0, 3, 'ISUZU', 'TX', '170 แรงม้า', 'รถบรรทุกน้ำ 6 ล้อ', '81-9334', '006-47-0014', 2547, 0, 17, 'กองช่าง', '', '', '', 'รับโอนจากทางหลวงชนบท', '2023-11-08 08:16:20', 0, 0, NULL),
(28, 0, 3, 'FOTON', 'BJ1153', '240 แรงม้า', 'รถบรรทุกน้ำ 6 ล้อ', '84-2614', '006-62-0022', 2562, 1750000, 2, 'กองกิจการพาณิชย์', '', '', '', '', '2023-11-08 08:16:20', 0, 0, NULL),
(29, 0, 4, 'MITSUBISHI', 'CANTER', '125 แรงม้า', 'รถบรรทุก 6 ล้อ', '81-7778', '002-37-0002', 2537, 530000, 27, 'กองช่าง', '', '', '', 'ขนาด 2 ตัน', '2023-11-08 08:16:20', 0, 0, NULL),
(30, 0, 4, 'MITSUBISHI', 'CANTER', '125 แรงม้า', 'รถบรรทุก 6 ล้อ', '82-4485', '002-49-0003', 2549, 940000, 15, 'กองช่าง', '', '', '', 'ขนาด 4 ตัน', '2023-11-08 08:16:20', 0, 0, NULL),
(31, 0, 4, 'MITSUBISHI', 'FK457 ', '210 แรงม้า', 'รถบรรทุก 6 ล้อ', '82-5170', '002-50-0004', 2550, 1460000, 14, 'กองช่าง', '', '', '', 'ขนาด 6 ตัน', '2023-11-08 08:16:20', 0, 0, NULL),
(32, 0, 4, 'MITSUBISHI', 'CANTER', '125 แรงม้า', 'รถบรรทุก 6 ล้อ', '82-5171', '002-50-0005', 2550, 980000, 14, 'กองช่าง', '', '', '', 'ขนาด 4 ตัน', '2023-11-08 08:16:20', 0, 0, NULL),
(33, 0, 4, 'MITSUBISHI', 'CANTER', '125 แรงม้า', 'รถบรรทุก 6 ล้อ', '82-6258', '002-51-0007', 2551, 770000, 13, 'กองช่าง', '', '', '', 'ขนาด 2 ตัน', '2023-11-08 08:16:20', 0, 0, NULL),
(34, 0, 4, 'MITSUBISHI', 'CANTER', '125 แรงม้า', 'รถบรรทุก 6 ล้อ', '82-6261', '002-51-0008', 2551, 770000, 13, 'กองช่าง', '', '', '', 'ขนาด 2 ตัน', '2023-11-08 08:16:20', 0, 0, NULL),
(35, 0, 4, 'ISUZU', 'NPR75 ', '150 แรงม้า', 'รถบรรทุก 6 ล้อ', '83-1099', '002-54-0009', 2554, 1320000, 10, 'สำนักปลัดฯ', '', '', '', 'ขนาด 4 ตัน', '2023-11-08 08:16:20', 0, 0, NULL),
(36, 0, 4, 'ISUZU ', 'THR114', '165 แรงม้า', 'รถบรรทุก 6 ล้อ', '81-7675', '017-47-0015', 2547, 0, 17, 'กองช่าง', '', '', '', 'รับโอนจากทางหลวงชนบท', '2023-11-08 08:16:20', 0, 0, NULL),
(37, 0, 4, 'ISUZU ', 'NPR 75', '150 แรงม้า', 'รถบรรทุก 6 ล้อ', '82-8565', '017-52-0016', 2552, 2990000, 12, 'กองช่าง', '', '', '', '', '2023-11-08 08:16:20', 0, 0, NULL),
(38, 0, 4, 'ISUZU ', 'NMR 85', '130 แรงม้า', 'รถบรรทุก 6 ล้อ', '82-8747', '017-52-0017', 2552, 2990000, 12, 'กองช่าง', '', '', '', '', '2023-11-08 08:16:20', 0, 0, NULL),
(39, 0, 5, 'HINO', 'FE2J', '175 แรงม้า', 'รถบรรทุกเทท้าย 6 ล้อ', '82-2377', '017-47-0013', 2547, 0, 17, 'กองช่าง', '', '', '', 'รับโอนจากกรมส่งเสริมการเกษตร', '2023-11-08 08:16:20', 0, 0, NULL),
(40, 0, 5, 'FOTON', 'BJ1153', '240 แรงม้า', 'รถบรรทุกเทท้าย 6 ล้อ', '84-2613', '017-62-0024', 2562, 0, 2, 'กองกิจการพาณิชย์', '', '', '', '', '2023-11-08 08:16:20', 0, 0, NULL),
(41, 0, 6, 'ISUZU ', ' JCR', '165 แรงม้า', 'รถบรรทุกติดตั้งเครนสลิง', '81-7780', '017-26-0006', 2526, 545000, 38, 'กองช่าง', '', '', '', '', '2023-11-08 08:16:20', 0, 0, NULL),
(42, 0, 6, 'ISUZU ', 'FTR 34', '240 แรงม้า', 'รถบรรทุกติดตั้งเครนสลิง', '83-3323', '045-56-0001', 2556, 4492000, 8, 'สำนักปลัดฯ', '', '', '', '', '2023-11-08 08:16:20', 0, 0, NULL),
(43, 0, 6, 'ISUZU ', 'FTR 34', '240 แรงม้า', 'รถบรรทุกติดตั้งเครนสลิง', '84-2644', '045-63-0002', 2563, 2620000, 1, 'กองกิจการพาณิชย์', '', '', '', '', '2023-11-08 08:16:20', 0, 0, NULL),
(44, 0, 7, 'ISUZU ', 'FTR32', '195 แรงม้า', 'รถเจาะบ่อบาดาล 6 ล้อ', '83-5637', '044-37-0003', 2537, 3540000, 27, 'สำนักปลัดฯ', '', '', '', 'ดัดแปลงจากรถสูบน้ำ', '2023-11-08 08:16:20', 0, 0, NULL),
(45, 0, 7, 'ISUZU ', 'FTR34', '240 แรงม้า', 'รถเจาะบ่อบาดาล 6 ล้อ', '83-4426', '044-56-0002', 2556, 18460000, 8, 'สำนักปลัดฯ', '', '', '', '', '2023-11-08 08:16:20', 0, 0, NULL),
(46, 0, 8, 'ISUZU ', 'FTR 34', '240 แรงม้า', 'รถปรับสภาพพื้นผิวถนน 6 ล้อ', '83-4149', '048-56-0002', 2556, 17960000, 8, 'กองช่าง', '', '', '', '', '2023-11-08 08:16:20', 0, 0, NULL),
(47, 0, 8, 'ISUZU ', 'FTR 34', '240 แรงม้า', 'รถปรับสภาพพื้นผิวถนน 6 ล้อ', '83-4150', '048-56-0001', 2556, 17960000, 8, 'กองช่าง', '', '', '', '', '2023-11-08 08:16:20', 0, 0, NULL),
(48, 0, 9, 'HINO ', 'FM 8J', '212 แรงม้า', 'รถปรับสภาพพื้นผิวถนนอัตโนมัติ', '83-1500', '017-55-0020', 2555, 22402500, 9, 'กองช่าง', '', '', '', '10 ล้อ', '2023-11-08 08:16:20', 0, 0, NULL),
(49, 0, 9, 'HINO ', 'FM 8J', '212 แรงม้า', 'รถปรับสภาพพื้นผิวถนนอัตโนมัติ', '83-1501', '017-55-0021', 2555, 22402500, 9, 'กองช่าง', '', '', '', '10 ล้อ', '2023-11-08 08:16:20', 0, 0, NULL),
(50, 0, 10, 'MITSUBISHI ', 'FN 627', '220 แรงม้า', 'รถเทรลเลอร์ 10 ล้อ', '82-5880', '002-50-0006', 2550, 2499000, 14, 'กองช่าง', '', '', '', 'แบบช่วงสั้น', '2023-11-08 08:16:20', 0, 0, NULL),
(51, 0, 10, 'HINO ', 'KT 925', '175 แรงม้า', 'รถเทรลเลอร์ 10 ล้อ', '81-7783', '013-27-0001', 2527, 650000, 37, 'กองช่าง', '', '', '', 'แบบช่วงสั้น', '2023-11-08 08:16:20', 0, 0, NULL),
(52, 0, 10, 'NISSAN ', 'CW 30', '230 แรงม้า', 'รถเทรลเลอร์ 10 ล้อ', '82-2511', '013-48-0003', 2548, 8000000, 16, 'กองช่าง', '', '', '', 'แบบช่วงสั้น', '2023-11-08 08:16:20', 0, 0, NULL),
(53, 0, 11, 'MITSUBISHI ', 'FN 627', '220 แรงม้า', 'รถเทรลเลอร์ 18 ล้อ', '82-4201', '013-49-0004', 2549, 2191000, 15, 'กองช่าง', '', '', '', 'หัวลากจูง', '2023-11-08 08:16:20', 0, 0, NULL),
(54, 0, 11, 'HINO', 'ไม่ได้ระบุรุ่น', '344 แรงม้า', 'รถเทรลเลอร์ 18 ล้อ', '83-1510', '013-55-0005', 2555, 3491000, 9, 'กองช่าง', '', '', '', 'หัวลากจูง', '2023-11-08 08:16:20', 0, 0, NULL),
(55, 0, 11, 'HINO', 'FM2P', '380 แรงม้า', 'รถเทรลเลอร์ 18 ล้อ', '84-3023', '013-63-0007', 2563, 3792920, 1, 'กองช่าง', '', '', '', 'หัวลากจูง ซื้อพร้อมหางพ่วง 84-3024', '2023-11-08 08:16:20', 0, 0, NULL),
(56, 0, 11, 'HINO', 'FM2P', '380 แรงม้า', 'รถเทรลเลอร์ 18 ล้อ', '84-3025', '013-63-0008', 2563, 3792920, 1, 'กองช่าง', '', '', '', 'หัวลากจูง ซื้อพร้อมหางพ่วง 84-3026', '2023-11-08 08:16:20', 0, 0, NULL),
(57, 0, 11, 'ISUZU ', 'GXZ77N', '360 แรงม้า', 'รถเทรลเลอร์ 18 ล้อ', '84-3228', '013-63-0009', 2563, 3600000, 1, 'กองช่าง', '', '', '', 'หัวลากจูง ซื้อพร้อมหางพ่วง 84-3230', '2023-11-08 08:16:20', 0, 0, NULL),
(58, 0, 11, 'ISUZU ', 'GXZ77N', '360 แรงม้า', 'รถเทรลเลอร์ 18 ล้อ', '84-3229', '013-63-0010', 2563, 3600000, 1, 'กองช่าง', '', '', '', 'หัวลากจูง ซื้อพร้อมหางพ่วง 84-3231', '2023-11-08 08:16:20', 0, 0, NULL),
(59, 0, 11, 'หางพ่วง SMM', 'ไม่ได้ระบุรุ่น', '', 'หางพ่วง', '82-4202', '013-48-0002', 2548, 800000, 16, 'กองช่าง', '', '', '', 'หางพ่วง ', '2023-11-08 08:16:20', 0, 0, NULL),
(60, 0, 11, 'หางพ่วง TBT', 'ไม่ได้ระบุรุ่น', '', 'หางพ่วง', '83-1511', '013-55-0006', 2555, 1000000, 9, 'กองช่าง', '', '', '', 'หางพ่วง ', '2023-11-08 08:16:20', 0, 0, NULL),
(61, 0, 11, 'หางพ่วง SMC', 'ไม่ได้ระบุรุ่น', '', 'หางพ่วง', '84-3024', '013-63-0007', 2563, 3792920, 1, 'กองช่าง', '', '', '', 'หางพ่วง ซื้อพร้อมหัวลาก 84-3023', '2023-11-08 08:16:20', 0, 0, NULL),
(62, 0, 11, 'หางพ่วง SMC', 'ไม่ได้ระบุรุ่น', '', 'หางพ่วง', '84-3026', '013-63-0008', 2563, 3792920, 1, 'กองช่าง', '', '', '', 'หางพ่วง ซื้อพร้อมหัวลาก 84-3025', '2023-11-08 08:16:20', 0, 0, NULL),
(63, 0, 11, 'หางพ่วง JPN', 'ไม่ได้ระบุรุ่น', '', 'หางพ่วง', '84-3230', '013-63-0009', 2563, 3600000, 1, 'กองช่าง', '', '', '', 'หางพ่วง ซื้อพร้อมหัวลาก 84-3228', '2023-11-08 08:16:20', 0, 0, NULL),
(64, 0, 11, 'หางพ่วง JPN', 'ไม่ได้ระบุรุ่น', '', 'หางพ่วง', '84-3231', '013-63-0010', 2563, 3600000, 1, 'กองช่าง', '', '', '', 'หางพ่วง ซื้อพร้อมหัวลาก 84-3229', '2023-11-08 08:16:20', 0, 0, NULL),
(65, 0, 12, 'HINO ', 'FM 8J', '251 แรงม้า', 'รถบรรทุกสเปรย์ยาง ', '83-1156', '022-54-0001', 2554, 5495000, 10, 'กองช่าง', '', '', '', ' 6  ล้อ', '2023-11-08 08:16:20', 0, 0, NULL),
(66, 0, 13, 'ISUZU', 'NQR75 ', '175 แรงม้า', 'รถบรรทุกโดยสาร', '40-0321', '003-53-0001', 2553, 2192000, 11, 'รร.สวนกุหลาบฯ', '', '', '', ' มินิบัส 6 ล้อ', '2023-11-08 08:16:20', 0, 0, NULL),
(67, 0, 13, 'ISUZU', 'NPR34 ', '150 แรงม้า', 'รถบรรทุกโดยสาร', '40-0365', '002-58-0010', 2558, 1375000, 10, 'รร.สวนกุหลาบฯ', '', '', '', ' 6 ล้อ ขนาด 6 ตัน', '2023-11-08 08:16:20', 0, 0, NULL),
(68, 0, 13, 'ISUZU', 'NPR75 ', '150 แรงม้า', 'รถบรรทุกโดยสาร', '40-0388', '002-62-0011', 2562, 1320000, 10, 'รร.สวนกุหลาบฯ', '', '', '', ' 6 ล้อ ขนาด 4 ตัน', '2023-11-08 08:16:20', 0, 0, NULL),
(69, 0, 14, 'ISUZU ', 'FTR 34', '240 แรงม้า', ' รถสุขาเคลื่อนที่ ', '83-4684', '050-56-0001', 2556, 6980000, 8, 'สำนักปลัดฯ', '', '', '', ' 6  ล้อ', '2023-11-08 08:16:20', 0, 0, NULL),
(70, 0, 15, 'HINO', 'VICTOR', '240 แรงม้า', 'รถบรรทุกขยะ', '84-2578', '011-62-0003', 2562, 0, 2, 'กองกิจการพาณิชย์', '', '', '', ' 6  ล้อ', '2023-11-08 08:16:20', 0, 0, NULL),
(73, 1, NULL, 'HONDA', 'PC300-88', '9000 แรงม้า', 'รถบรรทุกขยะ', 'จ-7868', '111-22-0000', 2546, 85000000, NULL, 'กองกิจการพาณิชย์', 'Harry Potter2', '0000000000', 'image/trucks/1782070489743082.jpg|image/trucks/1782070489743716.jpg|image/trucks/1782070489744072.jpg|image/trucks/1782070489744328.jpg', 'test22', '2023-11-16 04:14:17', 0, 1, '2023-11-15 21:14:17');

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `username` varchar(255) NOT NULL,
  `name` varchar(255) NOT NULL,
  `surname` varchar(255) NOT NULL,
  `department` varchar(255) NOT NULL,
  `email` varchar(255) NOT NULL,
  `email_verified_at` timestamp NULL DEFAULT NULL,
  `is_admin` tinyint(1) DEFAULT NULL,
  `password` varchar(255) NOT NULL,
  `check_pass` varchar(255) NOT NULL,
  `remember_token` varchar(100) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `deleted` tinyint(4) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`id`, `username`, `name`, `surname`, `department`, `email`, `email_verified_at`, `is_admin`, `password`, `check_pass`, `remember_token`, `created_at`, `updated_at`, `deleted`) VALUES
(1, 'admin', 'Admin', 'admin', 'ICTC', 'admin@admin.com', NULL, 2, '$2y$10$Qtw9C5602ZX/VnEX2tj5Be29H8Xdeu9nV7yoxeEvEyo7x/0gKeVz2', '123456789', NULL, '2023-09-24 21:06:02', '2023-09-24 21:06:02', 1),
(2, 'user', 'User', 'user', 'ICTC', 'user@user.com', NULL, 1, '$2y$10$z12Hz5/0XYIXgUjyRtLj9OhGjB6oB2.zEIKZWn88Kftsm2yqmU.Iy', '123456789', NULL, '2023-09-24 21:06:02', '2023-09-24 21:06:02', 1);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `failed_jobs`
--
ALTER TABLE `failed_jobs`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `failed_jobs_uuid_unique` (`uuid`);

--
-- Indexes for table `general_work`
--
ALTER TABLE `general_work`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `logdata`
--
ALTER TABLE `logdata`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `machine2`
--
ALTER TABLE `machine2`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `migrations`
--
ALTER TABLE `migrations`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `password_resets`
--
ALTER TABLE `password_resets`
  ADD PRIMARY KEY (`email`);

--
-- Indexes for table `personal_access_tokens`
--
ALTER TABLE `personal_access_tokens`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `personal_access_tokens_token_unique` (`token`),
  ADD KEY `personal_access_tokens_tokenable_type_tokenable_id_index` (`tokenable_type`,`tokenable_id`);

--
-- Indexes for table `smcar2`
--
ALTER TABLE `smcar2`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `truck`
--
ALTER TABLE `truck`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `users_email_unique` (`email`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `failed_jobs`
--
ALTER TABLE `failed_jobs`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `general_work`
--
ALTER TABLE `general_work`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=84;

--
-- AUTO_INCREMENT for table `logdata`
--
ALTER TABLE `logdata`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=27;

--
-- AUTO_INCREMENT for table `machine2`
--
ALTER TABLE `machine2`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=137;

--
-- AUTO_INCREMENT for table `migrations`
--
ALTER TABLE `migrations`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT for table `personal_access_tokens`
--
ALTER TABLE `personal_access_tokens`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `smcar2`
--
ALTER TABLE `smcar2`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=189;

--
-- AUTO_INCREMENT for table `truck`
--
ALTER TABLE `truck`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=74;

--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
